{
  "dataPreparation" : {
    "abs" : "מחזיר את הערך המוחלט של הערך הנומרי. ",
    "acos" : "הפונקציה מחזירה את הקוסינוס ההופכי (לדוגמה, ארק-קוסינוס) של expr, כאילו הוא מחושב על-ידי java.lang.Math.acos. ",
    "add_months" : "מחזיר את התאריך שהוא num_חודשים אחרי start_date. ",
    "approx_percentile" : "החזרת הניצב המוערך של העמודה המספרי קול שהוא הערך הקטן ביותר בערכי קול שהוזמנו (ממוינות לפחות עד גדול) כך שלא יותר מאחוז ערכי קול הוא קטן מערך או שווה לערך זה.  ערך האחוז חייב להיות בין 0.0 ל-1.0.  פרמטר הדיוק (ברירת מחדל: 10000) הוא מיטרל מספרי חיובי ששולט על דיוק ברמת הזיכרון.  הערך הגבוה ביותר של דיוק מניב דיוק טוב יותר, 1.0/דיוק הוא השגיאה היחסית של הקירוב.  כאשר האחוז הוא מערך, כל ערך של מערך האחוזים חייב להיות בין 0.0 ל-1.0.  במקרה זה, הפונקציה מחזירה את מערך הערכים המוערך של עמודה קול במערך האחוזים הנתון. ",
    "asin" : "הפונקציה מחזירה את הסינוס ההופכי (המכונה גם קשת הסינוס) הקשת של הקשת של expr, כאילו הוא מחושב על-ידי java.lang.Math.asin. ",
    "atan" : "החזרת הטנגנס ההופכי (הידוע גם בשם ארק מנטנגנס) של expr, כאילו הוא מחושב על-ידי java.lang.Math.atan ",
    "avg" : "החזרת הממוצע המחושב מהערכים של קבוצה. ",
    "casewhen" : "כאשר expr1 = true, הפונקציה מחזירה expr2; אחרת כאשר expr3 = true, הפונקציה מחזירה expr4; אחרת מחזירה expr5.  ארגומנטים: <br> expr1, expr3-ביטויי תנאי הענף צריכים להיות מסוג בוליאני.  <br> expr2, expr4, expr5-ביטויי ערך הענף וביטוי ערך אחר צריכים להיות אותו סוג או כפייה לסוג משותף. ",
    "char_length" : "מחזיר את אורך התווים של נתוני המחרוזת או מספר הבתים של נתונים בינאריים.  אורך נתוני המחרוזת כולל את המרחבים הנגררים.  אורך הנתונים הבינאריים כולל אפסים בינאריים. ",
    "coalesce" : "מחזיר את הארגומנט הראשון שאינו null אם קיים.  במקרים אחרים, null. ",
    "concat" : "מחזיר את concatenation של col1, col2, ..., colN. ",
    "cos" : "מחזיר את הקוסינוס של expr, כאילו הוא מחושב על-ידי java.lang.Math.cos. ",
    "current_date" : "החזרת התאריך הנוכחי בתחילת הערכת השאילתה. ",
    "current_timestamp" : "החזרת חותמת הזמן הנוכחית בתחילת הערכת השאילתה. ",
    "date_add" : "מחזיר את התאריך שהוא num_days אחרי start_date. ",
    "date_sub" : "מחזיר את התאריך שהוא num_days לפני start_date. ",
    "date_trunc" : "הפונקציה מחזירה נקודות חותמת זמן מקוצצות אל היחידה שצוינה על-ידי מודל העיצוב fmt.  לא צריך להיות אחד מ - [\"שנה\", \"YYYY\", \"YY\", \"יון\", \"MON\", \"M\", \"MM\", \"יום\", \"די\", \"שעה\", \"שעה\", \"רגע\", \"רגע\", \"שבוע\", \"QUERTER\"] ",
    "datediff" : "החזרת מספר הימים מתאריך ההתחלה לתאריך הסיום. ",
    "day" : "החזרת היום בחודש של התאריך/חותמת הזמן. ",
    "dayofmonth" : "החזרת היום בחודש של התאריך/חותמת הזמן. ",
    "dayofweek" : "הפונקציה מחזירה את היום בשבוע עבור תאריך/שעה (1 = יום ראשון, 2 = יום שני, 7 = שבת). ",
    "dayofyear" : "הפונקציה מחזירה את היום בשנה של התאריך/חותמת הזמן. ",
    "dense_rank" : "חישוב הדירוג של ערך בקבוצה של ערכים.  התוצאה היא אחת בתוספת ערך הדירוג שהוקצה קודם לכן.  בשונה מדורגת הפונקציה, dense_דרגה לא תפיק פערים ברצף הדירוג. ",
    "element_at" : "החזרת מרכיב מערך באינדקס נתון (מבוסס 1).  אם האינדקס < 0, ניגש למרכיבים מהאחרון.  מחזיר NULL אם האינדקס חורג מאורך המערך. ",
    "element_at2" : "מחזיר ערך עבור המפתח הנתון, או NULL אם המפתח אינו כלול במפה ",
    "exists" : "בדיקה האם מבוסס על חוזה עבור מרכיב אחד או יותר במערך. ",
    "exp" : "מחזיר את e לכוח של expr. ",
    "factorial" : "החזרת העצרת של expr.  Expr הוא [0 ... 20]. במקרים אחרים, null. ",
    "floor" : "מחזיר את המספר השלם הגדול ביותר שאינו גדול מ-expr. ",
    "format_string" : "מחזיר מחרוזת מעוצבת מתוך מחרוזות עיצוב של סגנון הדפסה. ",
    "hint" : "לחצו על אחד מהפונקציות המפורטות כדי לקבל מידע נוסף על כך. ",
    "hour" : "מחזיר את רכיב השעה של string/timestamp. ",
    "if" : "אם הערך expr1 הוא True, הפונקציה מחזירה expr2; אחרת מחזירה את expr3. ",
    "last_day" : "הפונקציה מחזירה את היום האחרון בחודש שבו שייך התאריך. ",
    "lcase" : "מחזיר את str עם כל התווים שהשתנו לאותיות קטנות. ",
    "left" : "הפונקציה מחזירה את התווים השמאלניים ביותר (לן יכול להיות סוג מחרוזת) מתוך המחרוזת str, אם הערך לן קטן מ-0 או שווה ל-0, התוצאה היא מחרוזת ריקה. ",
    "length" : "מחזיר את אורך התווים של נתוני המחרוזת או מספר הבתים של נתונים בינאריים.  אורך נתוני המחרוזת כולל את המרחבים הנגררים.  אורך הנתונים הבינאריים כולל אפסים בינאריים. ",
    "ln" : "החזרת הלוגריתם הטבעי (בסיס e) של expr. ",
    "locate" : "החזרת המיקום של המופע הראשון של substr ב-str אחרי מיקום של מיקום.  ערך ה-pos והחזר הנתון מבוססים על 1. ",
    "log" : "החזרת הלוגריתם של expr עם בסיס. ",
    "lower" : "מחזיר את str עם כל התווים שהשתנו לאותיות קטנות. ",
    "lpad" : "הפונקציה מחזירה את str, יישאר מרופד עם פנקס באורך של קאלן.  אם str ארוך יותר מלן, ערך ההחזרה מקוצר לתווים גנובים. ",
    "ltrim1" : "סילוק תווי הרווח המובילים מ-str. ",
    "ltrim2" : "סילוק המחרוזת המובילה מכיל את התווים ממחרוזת לקצץ. ",
    "max" : "החזרת הערך המקסימלי של expr ",
    "mean" : "החזרת הממוצע המחושב מהערכים של קבוצה. ",
    "min" : "החזרת הערך המינימלי של expr ",
    "minute" : "החזרת רכיב הדקה של string/timestamp. ",
    "mod" : "החזרת השארית אחרי expr1/expr2. ",
    "month" : "החזרת רכיב החודש של התאריך/חותמת הזמן. ",
    "months_between" : "אם timestamp1 מאוחר יותר מ-timestamp2, התוצאה חיובית.  אם timestamp1 ו-timestamp2 נמצאים באותו יום בחודש, או שניהם הם היום האחרון של החודש, זמן היום לא יילקח בחשבון.  אחרת, ההפרש מחושב בהתבסס על 31 ימים בחודש, ומעוגל ל-8 ספרות אלא אם כן העקיפה = false. ",
    "next_day" : "מחזיר את התאריך הראשון מאוחר יותר מ-start_date ונקרא כפי שצוין. ",
    "not" : "לוגי לא. ",
    "nullif" : "מחזיר null אם expr1 שווה ל-expr2, או expr1 אחר. ",
    "nvl" : "הפונקציה מחזירה expr2 אם expr1 הוא null או expr1 אחר. ",
    "percent_rank" : "חישוב דירוג האחוז של ערך בקבוצה של ערכים. ",
    "percentile1" : "מחזיר את הערך המדוייק של העמודה המספרי קול באחוז הנתון.  ערך האחוז חייב להיות בין 0.0 ל-1.0.  הערך של התדירות חייב להיות אינטגרלי חיובי ",
    "percentile2" : "מחזיר את מערך ערכי הסנטילה המדויק של עמודה מספרית באחוזים הנערכים.  כל ערך של מערך האחוזים חייב להיות בין 0.0 ל-1.0.  הערך של התדירות חייב להיות אינטגרלי חיובי ",
    "pow" : "העלאת גרסה 1 לכח של expr2. ",
    "quarter" : "מחזירה את הרבעון של השנה עבור התאריך, בטווח 1 עד 4. ",
    "replace" : "החלפת כל המופעים של החיפוש עם ההחלפה. ",
    "round" : "מחזיר את expr מעוגל למקומות עשרוניים באמצעות מצב עיגול חצי. ",
    "rtrim1" : "סילוק תווי הרווח הנגררים מתוך str. ",
    "rtrim2" : "סילוק המחרוזת הנגרפת המכילה את התווים ממחרוזת הקיצוץ מתוך str ",
    "second" : "החזרת רכיב השני של string/timestamp. ",
    "sha" : "החזרת ערך Hash של sha1 בתור מחרוזת hex של expr. ",
    "sin" : "הפונקציה מחזירה את הסינוס של expr, כאילו הוא מחושב על-ידי java.lang.Math.sin. ",
    "skewness" : "מחזיר את ערך ה-skewness המחושב מהערכים של קבוצה. ",
    "stddev" : "החזרת סטיית התקן לדוגמה המחושבת מהערכים של קבוצה. ",
    "stddev_pop" : "החזרת סטיית תקן האוכלוסיה המחושבת מהערכים של קבוצה. ",
    "stddev_samp" : "החזרת סטיית התקן לדוגמה המחושבת מהערכים של קבוצה. ",
    "substr" : "מחזיר את תת-המחרוזת של str שמתחיל ב-pos ואורך, או את הפרוסה של מערך הבתים המתחיל ב-pos ואורך. ",
    "tan" : "מחזיר את הטנגנס של expr, כאילו הוא מחושב על-ידי java.lang.Math.tan. ",
    "timestamp" : "Casts הערך expr ל-timestamp של סוג הנתונים המוגדר כיעד. ",
    "to_date" : "מציין את הביטוי date_str עם ביטוי fmt לתאריך.  מחזיר null עם קלט לא חוקי.  כברירת מחדל, הוא עוקב אחר כללי הליהוק לתאריך אם fmt הושמט. ",
    "to_timestamp" : "מציין את הביטוי timestamp_str עם ביטוי fmt לחותמת זמן.  מחזיר null עם קלט לא חוקי.  כברירת מחדל, הוא עוקב אחר כללי הליהוק לחותמת זמן אם fmt הושמט. ",
    "trim" : "לקצץ (str) - מסלק את תווי הרווח המובילים והנגררים מstr.  <br> לקצץ (שניהם trimStr מ-str) - סלקו את תווי trimStr מובילים ונגררים מ-str <br> לקצץ (LEADING trimStr מ-str) - סלקו את תווי השלישייה המובילה מ-str <br> לקצץ (הפקודה trimStr מ-str) - סלקו את ה -  שורות trimStr נגררים מתוך str <br> Arguments: <br> str-a בביטוי מחרוזת <br> trimStr-תווי מחרוזת לקצץ, ערך ברירת המחדל הוא מרחב יחיד <br> שניהם, מתוך-אלה מילות מפתח לציון  תווי מחרוזת משני הקצוות של המחרוזת <br> LEADING, FROM-אלה הם מילות מפתח לציון ערכי מחרוזת של טריקת מהקצה השמאלי של ה  מחרוזת <br> רכבת, מתוך-אלה הם מילות מפתח לציון ערכי מחרוזת של מיון מסוף המחרוזת ",
    "ucase" : "מחזיר את str עם כל התווים שהשתנו לאותיות רישיות. ",
    "upper" : "מחזיר את str עם כל התווים שהשתנו לאותיות רישיות. ",
    "variance" : "החזרת השונות לדוגמה המחושבת מערכים של קבוצה. ",
    "weekday" : "הפונקציה מחזירה את היום בשבוע עבור תאריך/שעה (0 = יום שני, 1 = שלישי, ..., 6 = יום ראשון). ",
    "weekofyear" : "החזרת השבוע של השנה של התאריך הנתון.  שבוע נחשב להתחיל ביום שני ובשבוע הראשון הוא השבוע הראשון עם > 3 ימים. ",
    "year" : "החזרת רכיב השנה של התאריך/חותמת הזמן."
  }
}