{
    "dataPreparation": {
	 "abs": "Vráti absolútnu hodnotu číselnej hodnoty.",
         "acos": "Vráti inverzný kosínus (známy aj ako arc cosínus) výrazu expr, ako keby ho vypočítal java.lang.Math.acos.",
         "add_months": "Vráti dátum, ktorý je num_months po dátume začiatku.",
         "approx_percentile": "Vráti približný percentil číselného stĺpca stĺpca, ktorý je najmenšou hodnotou v usporiadaných hodnotách stĺpca (zoradených od najmenšieho po najväčšie) tak, že maximálne percento hodnôt stĺpca nie je menšie alebo rovné tejto hodnote . Hodnota percenta musí byť medzi 0,0 a 1,0. Parameter presnosti (predvolená hodnota: 10 000) je kladný číselný literál, ktorý riadi presnosť aproximácie na úkor pamäte. Vyššia hodnota presnosti vedie k vyššej presnosti, 1,0/presnosť je relatívna chyba aproximácie. Keď je percento pole, každá hodnota percentuálneho poľa musí byť medzi 0,0 a 1,0. V tomto prípade vráti približné percentilové pole stĺpca col v danom percentuálnom poli.",
         "asin": "Vráti inverzný sínus (známy aj ako oblúkový sínus) oblúkový sin výrazu expr, ako keby ho vypočítal java.lang.Math.asin.",
         "atan": "Vráti inverzný tangens (aka arkus tangens) výrazu expr, ako keby ho vypočítal java.lang.Math.atan",
         "avg": "Vráti priemer vypočítaný z hodnôt skupiny.",
         "casewhen": "Keď výraz1 = true, vráti výraz 2; inak, keď výraz3 = true, vráti výraz 4; else vráti výraz 5. Argumenty: <br> výraz1, výraz3 – všetky výrazy podmienky vetvenia by mali byť boolovského typu. <br> výraz2, expr4, expr5 - výrazy hodnoty vetvy a inak výraz hodnoty by mali byť rovnakého typu alebo by mali byť koercibilné na spoločný typ.",
         "char_length": "Vráti dĺžku znaku údajov reťazca alebo počet bajtov binárnych údajov. Dĺžka údajov reťazca zahŕňa koncové medzery. Dĺžka binárnych údajov zahŕňa binárne nuly.",
         "coalesce": "Vráti prvý nenulový argument, ak existuje. V opačnom prípade null.",
         "concat": "Vráti zreťazenie stĺpca1, stĺpca2, ..., stĺpca N.",
         "cos": "Vráti kosínus expr, ako keby ho vypočítal java.lang.Math.cos.",
         "current_date": "Vráti aktuálny dátum na začiatku vyhodnocovania dotazu.",
         "current_timestamp": "Vráti aktuálnu časovú pečiatku na začiatku vyhodnocovania dotazu.",
         "date_add": "Vráti dátum, ktorý je num_dní po dátume začiatku.",
         "date_sub": "Vráti dátum, ktorý je num_dní pred dátumom začiatku.",
         "date_trunc": "Vráti časovú pečiatku ts skrátenú na jednotku určenú modelom formátu fmt. fmt by mal byť jeden z [\"ROK\", \"RRRR\", \"RR\", \"MON\", \"MESIAC\", \"MM\", \"DEŇ\", \"DD\", \"HODINA\", \"MINÚTA\", \"DRUHÝ\", \"týždeň\", \"ŠTVRŤROK \"]",
         "datediff": "Vráti počet dní od dátumu začiatku do dátumu ukončenia.",
         "day": "Vráti deň v mesiaci dátumu/časovej pečiatky.",
         "dayofmonth": "Vráti deň v mesiaci dátumu/časovej pečiatky.",
         "dayofweek": "Vráti deň v týždni pre dátum/časovú pečiatku (1 = nedeľa, 2 = pondelok, ..., 7 = sobota).",
         "dayofyear": "Vráti deň v roku dátumu/časovej pečiatky.",
         "dense_rank": "Vypočíta poradie hodnoty v skupine hodnôt. Výsledkom je jedna plus predtým priradená hodnota poradia. Na rozdiel od funkcie rank, dense_rank nevytvorí medzery v poradí poradia.",
         "element_at": "Vráti prvok poľa pri danom (1) indexe. Ak index < 0, pristupuje k prvkom od posledného po prvý. Ak index prekročí dĺžku poľa, vráti hodnotu NULL.",
         "element_at2": "Vráti hodnotu pre daný kľúč alebo NULL, ak kľúč nie je obsiahnutý na mape",
         "exists": "Testuje, či predikát platí pre jeden alebo viac prvkov v poli.",
         "exp": "Vráti e silu expr.",
         "factorial": "Vráti faktoriál expr. expr je [0..20]. V opačnom prípade je null.",
	 "floor": "Vráti najväčšie celé číslo nie väčšie ako expr.",
         "format_string": "Vráti formátovaný reťazec z formátovacích reťazcov v štýle printf.",
         "hint": "Kliknutím na jednu z uvedených funkcií získate o nej viac informácií",
         "hour": "Vráti časť hodiny reťazca/časovej pečiatky.",
         "if": "Ak sa výraz expr1 vyhodnotí ako true, vráti výraz 2; inak vráti výraz 3.",
         "last_day": "Vráti posledný deň mesiaca, do ktorého dátum patrí.",
         "lcase": "Vráti str so všetkými znakmi zmenenými na malé písmená.",
         "left": "Vráti znaky len úplne vľavo (len môže byť typu reťazca) z reťazca str, ak je dĺžka menšia alebo rovná 0, výsledkom je prázdny reťazec.",
         "length": "Vráti dĺžku znaku údajov reťazca alebo počet bajtov binárnych údajov. Dĺžka údajov reťazca zahŕňa medzery na konci. Dĺžka binárnych údajov zahŕňa binárne nuly.",
         "ln": "Vráti prirodzený logaritmus (základ e) expr.",
         "locate": "Vráti pozíciu prvého výskytu substr v str po pozícii pozície. Daná poloha a návratová hodnota sú založené na 1.",
         "log": "Vráti logaritmus výrazu so základom.",
         "lower": "Vráti str so všetkými znakmi zmenenými na malé písmená.",
         "lpad": "Vráti str, doľava doplnené padom na dĺžku len. Ak je str dlhšie ako len, návratová hodnota sa skráti na znaky len.",
         "ltrim1": "Odstráni úvodné medzery zo str.",
         "ltrim2": "Odstráni úvodný reťazec obsahujúci znaky z reťazca orezania",
         "max": "Vráti maximálnu hodnotu expr",
         "mean": "Vráti priemer vypočítaný z hodnôt skupiny.",
         "min": "Vráti minimálnu hodnotu expr",
         "minute": "Vráti minútovú zložku reťazca/časovej pečiatky.",
         "mod": "Vráti zvyšok po expr1/expr2.",
         "month": "Vráti časť mesiaca dátumu/časovej pečiatky.",
         "months_between": "Ak je časová pečiatka 1 neskoršia ako časová pečiatka 2, výsledok je kladný. Ak sú časová pečiatka 1 a časová pečiatka 2 v rovnaký deň v mesiaci alebo obe sú posledným dňom v mesiaci, čas dňa bude ignorovaný. V opačnom prípade bude rozdiel sa vypočítava na základe 31 dní v mesiaci a zaokrúhli sa na 8 číslic, pokiaľ roundOff=false.",
         "next_day": "Vráti prvý dátum, ktorý je neskorší ako dátum_začiatku a pomenovaný ako je uvedené.",
         "not": "Logické nie.",
         "nullif": "Vráti hodnotu null, ak sa výraz 1 rovná výrazu 2 alebo výraz 1 inak.",
         "nvl": "Vráti výraz expr2, ak je výraz expr1 null, alebo v opačnom prípade výraz1.",
         "percent_rank": "Vypočíta percentuálne hodnotenie hodnoty v skupine hodnôt.",
         "percentile1": "Vráti presnú percentilovú hodnotu číselného stĺpca col pri danom percente. Hodnota percenta musí byť medzi 0,0 a 1,0. Hodnota frekvencie by mala byť kladný integrál",
         "percentile2": "Vráti presné pole percentilových hodnôt číselného stĺpca col pri daných percentách. Každá hodnota percentuálneho poľa musí byť medzi 0,0 a 1,0. Hodnota frekvencie by mala byť kladný integrál",
         "pow": "Zvýši expr1 na silu expr2.",
	 "quarter": "Vráti štvrťrok roka pre dátum v rozsahu 1 až 4.",
         "replace": "Nahradí všetky výskyty hľadania náhradou.",
         "round": "Vráti výraz zaokrúhlený na d desatinných miest pomocou režimu zaokrúhľovania HALF_UP.",
         "rtrim1": "Odstráni koncové medzery zo str.",
         "rtrim2": "Odstráni koncový reťazec, ktorý obsahuje znaky z reťazca orezania z reťazca str",
         "second": "Vráti druhú zložku reťazca/časovej pečiatky.",
         "sha": "Vráti hodnotu hash sha1 ako hexadecimálny reťazec výrazu.",
         "sin": "Vráti sínus expr, ako keby ho vypočítal java.lang.Math.sin.",
         "skewness": "Vráti hodnotu šikmosti vypočítanú z hodnôt skupiny.",
         "stddev": "Vráti vzorovú smerodajnú odchýlku vypočítanú z hodnôt skupiny.",
         "stddev_pop": "Vráti štandardnú odchýlku populácie vypočítanú z hodnôt skupiny.",
         "stddev_samp": "Vráti vzorovú smerodajnú odchýlku vypočítanú z hodnôt skupiny.",
         "substr": "Vráti podreťazec str, ktorý začína na pozícii a má dĺžku len, alebo časť bajtového poľa, ktorá začína na pozícii a má dĺžku len.",
         "tan": "Vráti tangens výrazu, ako keby ho vypočítal java.lang.Math.tan.",
         "timestamp": "Prenesie hodnotu expr do časovej pečiatky cieľového typu údajov.",
         "to_date": "Analyzuje výraz date_str s výrazom fmt na dátum. Vráti hodnotu null s neplatným vstupom. V predvolenom nastavení sa riadi pravidlami pretypovania na dátum, ak je fmt vynechaný.",
         "to_timestamp": "Analyzuje výraz timestamp_str s výrazom fmt na časovú pečiatku. Vráti hodnotu null s neplatným vstupom. V predvolenom nastavení sa riadi pravidlami pretypovania na časovú pečiatku, ak je fmt vynechaný.",
         "trim": "trim(str) - Odstráni úvodné a koncové znaky medzery zo str. <br> trim(OBJE trimStr FROM str) - Odstráni počiatočné a koncové znaky trimStr zo str <br> trim(LEADING trimStr FROM str) - Odstráňte počiatočné znaky trimStr z str <br> trim(TRAILING trimStr FROM str) - Odstráňte koncové znaky trimStr z str <br> Argumenty: <br> str - reťazcový výraz <br> trimStr - znaky reťazca orezania, ktoré sa majú orezať , predvolená hodnota je jedna medzera <br> BOTH, FROM - to sú kľúčové slová na určenie orezaných znakov reťazca z oboch koncov reťazca <br> LEADING, FROM - to sú kľúčové slová na určenie orezania znakov reťazca z ľavého konca reťazca string <br> TRAILING, FROM - toto sú kľúčové slová na určenie orezania znakov reťazca z pravého konca reťazca",
         "ucase": "Vráti str so všetkými znakmi zmenenými na veľké písmená.",
         "upper": "Vráti str so všetkými znakmi zmenenými na veľké písmená.",
         "variance": "Vráti výberový rozptyl vypočítaný z hodnôt skupiny.",
         "weekday": "Vráti deň v týždni pre dátum/časovú pečiatku (0 = pondelok, 1 = utorok, ..., 6 = nedeľa).",
         "weekofyear": "Vráti týždeň v roku daného dátumu. Za týždeň sa považuje pondelok a týždeň 1 je prvý týždeň s >3 dňami.",
         "year": "Vráti časť dátumu/času s rokom."
    }
}
