{
  "dataPreparation": {
    "abs": "Sayısal değerin mutlak değerini döndürür.",
    "acos": "Expr'ın ters kosinüsünü (diğer adıyla arc kosinüs) java.lang.Math.acos tarafından hesaplanmış gibi döndürür.",
    "add_months": "num_months sonra start_date tarihi döndürür.",
    "approx_percentile": "Sıralı col değerlerindeki en küçük değer olan (en azdan en büyüğe doğru sıralanmış) sayısal sütun col'unun yaklaşık yüzdelik dilimini, col değerlerinin yüzdesinden fazlası değerden küçük veya bu değere eşit olmayacak şekilde döndürür. Yüzde değeri 0,0 ile 1,0 arasında olmalıdır. Doğruluk parametresi (varsayılan: 10000), bellek pahasına yaklaşık doğruluğu kontrol eden pozitif bir sayısal değişmez değerdir. Daha yüksek doğruluk değeri daha iyi doğruluk sağlar, 1.0 / doğruluk yaklaşımın göreceli hatasıdır. Yüzde bir dizi olduğunda, yüzde dizisinin her değeri 0,0 ile 1,0 arasında olmalıdır. Bu durumda, verilen yüzde dizisindeki sütun kolunun yaklaşık yüzdelik dizisini döndürür.",
    "asin": "Ters sinüs (diğer adıyla arc sine) expr'ın ark günahını java.lang.Math.asin tarafından hesaplanmış gibi döndürür.",
    "atan": "Expr'nin ters teğetini (diğer adıyla arc teğet) java.lang.Math.atan tarafından hesaplanmış gibi döndürür",
    "avg": "Bir grubun değerlerinden hesaplanan ortalamayı döndürür.",
    "casewhen": "expr1 = true olduğunda, expr2 değerini döndürür; expr3 = true olduğunda, expr4 değerini döndürür; else expr5 değerini döndürür. Bağımsız değişken: <br> expr1, expr3 - dal koşulu ifadelerinin tümü boole türü olmalıdır. <br> expr2, expr4, expr5 - dal değeri ifadelerinin ve else değer ifadesinin tümü aynı türde olmalı veya ortak bir tür için zorlanabilir olmalıdır.",
    "char_length": "Dize verilerinin karakter uzunluğunu veya ikili verilerin bayt sayısını döndürür. Dize verilerinin uzunluğu, sondaki boşlukları içerir. İkili verilerin uzunluğu ikili sıfırları içerir.",
    "coalesce": "Varsa, null olmayan ilk bağımsız değişkeni döndürür. Aksi takdirde, null.",
    "concat": "col1, col2, ..., colN birleşimini döndürür.",
    "cos": "Expr'nin kosinüsünü java.lang.Math.cos tarafından hesaplanmış gibi döndürür.",
    "current_date": "Sorgu değerlendirmesinin başlangıcındaki geçerli tarihi döndürür.",
    "current_timestamp": "Sorgu değerlendirmesinin başlangıcında geçerli zaman damgasını döndürür.",
    "date_add": "num_days sonra start_date tarihi döndürür.",
    "date_sub": "num_days önce start_date tarihi döndürür.",
    "date_trunc": "fmt format modeli tarafından belirtilen birime kesilen zaman damgası ts'yi döndürür. fmt [\"YIL\", \"YYYY\", \"YY\", \"PZT\", \"AY\", \"MM\", \"GÜN\", \"GG\", \"SAAT\", \"DAKIKA\", \"SANIYE\", \"HAFTA\", \"ÇEYREK\"]",
    "datediff": "startDate ile endDate arasındaki gün sayısını döndürür.",
    "day": "Tarih/zaman damgasının ay gününü döndürür.",
    "dayofmonth": "Tarih/zaman damgasının ay gününü döndürür.",
    "dayofweek": "Tarih/zaman damgası için haftanın gününü döndürür (1 = Pazar, 2 = Pazartesi, ..., 7 = Cumartesi).",
    "dayofyear": "Tarih/zaman damgasının yıl gününü döndürür.",
    "dense_rank": "Bir değer grubundaki bir değerin sıralamasını hesaplar. Sonuç, bir artı daha önce atanmış rütbe değeridir. İşlev sıralamasının aksine, dense_rank sıralama dizisinde boşluklar oluşturmaz.",
    "element_at": "Verilen (1 tabanlı) dizinde dizi öğesini döndürür. Eğer indeks < 0, accesses elements from the last to the first. Returns NULL if the index exceeds the length of the array.",
    "element_at2": "Verilen anahtar için değer döndürür veya anahtar haritada yer almıyorsa NULL değerini döndürür",
    "exists": "Bir yüklemin dizideki bir veya daha fazla öğe için geçerli olup olmadığını test eder.",
    "exp": "E'yi expr'ın gücüne döndürür.",
    "factorial": "Expr'nin faktöriyeli değerini döndürür. expr [0..20] şeklindedir. Aksi takdirde, null.",
    "floor": "expr'den büyük olmayan en büyük tamsayıyı döndürür.",
    "format_string": "printf stili biçim dizelerinden biçimlendirilmiş bir dize döndürür.",
    "hint": "Hakkında daha fazla bilgi almak için listelenen işlevlerden birine tıklayın",
    "hour": "Dizenin/zaman damgasının saat bileşenini döndürür.",
    "if": "expr1 true olarak değerlendirilirse expr2 değerini döndürür; aksi takdirde expr3 değerini döndürür.",
    "last_day": "Tarihin ait olduğu ayın son gününü döndürür.",
    "lcase": "Tüm karakterler küçük harfle değiştirilmiş str değerini döndürür.",
    "left": "Dize str'den en soldaki len(len dize türü olabilir) karakterlerini döndürür, len 0'dan küçük veya eşitse sonuç boş bir dizedir.",
    "length": "Dize verilerinin karakter uzunluğunu veya ikili verilerin bayt sayısını döndürür. Dize verilerinin uzunluğu, sondaki boşlukları içerir. İkili verilerin uzunluğu ikili sıfırları içerir.",
    "ln": "Expr'nin doğal logaritmasını (e tabanı) döndürür.",
    "locate": "Str'deki ilk substr oluşumunun pozisyonunu pozisyondan sonra döndürür. Verilen pos ve dönüş değeri 1 tabanlıdır.",
    "log": "Expr'nin logaritmasını tabanla döndürür.",
    "lower": "Tüm karakterler küçük harfle değiştirilmiş str değerini döndürür.",
    "lpad": "Pedli sol dolgulu str'i len uzunluğuna döndürür. str len'den uzunsa, dönüş değeri len karakterlerine kısaltılır.",
    "ltrim1": "Önde gelen boşluk karakterlerini str.",
    "ltrim2": "Kırpma dizesindeki karakterleri içeren baştaki dizeyi kaldırır",
    "max": "Maksimum expr değerini döndürür",
    "mean": "Bir grubun değerlerinden hesaplanan ortalamayı döndürür.",
    "min": "Minimum expr değerini döndürür",
    "minute": "Dizenin/zaman damgasının dakika bileşenini döndürür.",
    "mod": "expr1/expr2'den sonra kalanı döndürür.",
    "month": "Tarih/zaman damgasının ay bileşenini döndürür.",
    "months_between": "Zaman damgası1 zaman damgası2'den sonraysa, sonuç olumludur. Zaman damgası1 ve zaman damgası2 ayın aynı günündeyse veya her ikisi de ayın son günüyse, günün saati yok sayılır. Aksi takdirde, fark ayda 31 güne göre hesaplanır ve roundOff=false olmadığı sürece 8 haneye yuvarlanır.",
    "next_day": "start_date sonra gelen ve belirtildiği gibi adlandırılan ilk tarihi döndürür.",
    "not": "Mantıklı değil.",
    "nullif": "expr1 expr2'ye eşitse null değerini veya aksi takdirde expr1 değerini döndürür.",
    "nvl": "expr1 null ise expr2 değerini veya aksi takdirde expr1 değerini döndürür.",
    "percent_rank": "Bir değer grubundaki bir değerin yüzde sıralamasını hesaplar.",
    "percentile1": "Verilen yüzdede sayısal sütun kolunun tam yüzdelik değerini döndürür. Yüzde değeri 0,0 ile 1,0 arasında olmalıdır. Frekansın değeri pozitif integral olmalıdır",
    "percentile2": "Verilen yüzde(ler)de sayısal sütun kolunun tam yüzdelik değer dizisini döndürür. Yüzde dizisinin her değeri 0,0 ile 1,0 arasında olmalıdır. Frekansın değeri pozitif integral olmalıdır",
    "pow": "expr1'i expr2'nin gücüne yükseltir.",
    "quarter1": "Tarih için yılın çeyreğini 1 ile 4 aralığında döndürür.",
    "quarter2": "Tarih için yılın çeyreğini 1 ile 4 aralığında döndürür.",
    "replace": "Tüm arama olaylarını değiştirme ile değiştirir.",
    "round": "HALF_UP yuvarlama modu kullanılarak expr'yi d ondalık basamaklarına yuvarlar.",
    "rtrim1": "Sondaki boşluk karakterlerini str.",
    "rtrim2": "Kırpma dizesindeki karakterleri içeren sondaki dizeyi str'den kaldırır",
    "second": "Dizenin/zaman damgasının ikinci bileşenini döndürür.",
    "sha": "expr'ın onaltılık dizesi olarak sha1 karma değeri döndürür.",
    "sin": "java.lang.Math.sin tarafından hesaplanmış gibi expr sinüsünü döndürür.",
    "skewness": "Bir grubun değerlerinden hesaplanan çarpıklık değerini döndürür.",
    "stddev": "Bir grubun değerlerinden hesaplanan örnek standart sapmayı döndürür.",
    "stddev_pop": "Bir grubun değerlerinden hesaplanan popülasyon standart sapmasını döndürür.",
    "stddev_samp": "Bir grubun değerlerinden hesaplanan örnek standart sapmayı döndürür.",
    "substr": "pos'ta başlayan ve uzunluk len olan str'nin alt dizesini veya pos'ta başlayan ve uzunluk len olan bayt dizisinin dilimini döndürür.",
    "tan": "Expr'nin teğetini java.lang.Math.tan tarafından hesaplanmış gibi döndürür.",
    "timestamp": "Expr değerini hedef veri türü zaman damgasına atar.",
    "to_date": "date_str deyimini fmt deyimiyle bir tarihe ayrıştırır. Geçersiz girişle null değerini döndürür. Varsayılan olarak, fmt atlanırsa bir tarihe kadar döküm kurallarını izler.",
    "to_timestamp": "timestamp_str ifadeyi fmt ifadesiyle bir zaman damgasına ayrıştırır. Geçersiz girişle null değerini döndürür. Varsayılan olarak, fmt atlanırsa yayın kurallarını bir zaman damgasına kadar izler.",
    "trim": "trim(str) - Öndeki ve sondaki boşluk karakterlerini str'den kaldırır. <br>        trim(BOTH trimStr FROM str) - Öndeki ve sondaki trimStr karakterlerini str'den çıkarın <br>        trim(LEADING trimStr FROM str) - Önde gelen trimStr karakterlerini str'den çıkarın <br>        trim(TRAILING trimStr FROM str) - Takip eden trimStr karakterlerini str'den çıkarın <br>        Bağımsız değişken: <br>        str - bir dize ifadesi <br>        trimStr - kırpılacak dize karakterlerini kırpın, varsayılan değer tek bir boşluktur <br>        BOTH, FROM - bunlar, dizenin her iki ucundan dize karakterlerinin kırpılmasını belirtmek için kullanılan anahtar kelimelerdir. <br>        LEADING, FROM - Bunlar, dizenin sol ucundan dize karakterlerini kırpmayı belirtmek için kullanılan anahtar kelimelerdir. <br>        SON, ITIBAREN - bunlar, dizenin sağ ucundan dize karakterlerini kırpmayı belirtmek için kullanılan anahtar kelimelerdir.",
    "ucase": "Tüm karakterler büyük harfle değiştirilerek str döndürür.",
    "upper": "Tüm karakterler büyük harfle değiştirilerek str döndürür.",
    "variance": "Bir grubun değerlerinden hesaplanan örnek farkını döndürür.",
    "weekday": "Tarih/zaman damgası için haftanın gününü döndürür (0 = Pazartesi, 1 = Salı, ..., 6 = Pazar).",
    "weekofyear": "Verilen tarihin yılının haftasını döndürür. Bir haftanın Pazartesi günü başladığı kabul edilir ve 1. hafta >3 gün olan ilk haftadır.",
    "year": "Tarih/zaman damgasının yıl bileşenini döndürür."
  }
}
