{
  "dataPreparation": {
    "abs": "Restituisce il valore assoluto del valore numerico.",
    "acos": "Restituisce il coseno inverso (noto anche come coseno dell'arco) di expr, come se fosse calcolato da java.lang.Math.acos.",
    "add_months": "Restituisce la data num_months dopo start_date.",
    "approx_percentile": "Restituisce il percentile approssimativo della colonna numerica col che è il valore più piccolo nei valori col ordinati (ordinati dal minimo al più grande) in modo tale che non più della percentuale dei valori col sia minore del valore o uguale a tale valore. Il valore della percentuale deve essere compreso tra 0,0 e 1,0. Il parametro di precisione (impostazione predefinita: 10000) è un valore letterale numerico positivo che controlla l'accuratezza dell'approssimazione al costo della memoria. Un valore di precisione più elevato produce una migliore precisione, 1.0 / accuratezza è l'errore relativo dell'approssimazione. Quando la percentuale è una matrice, ogni valore della matrice percentuale deve essere compreso tra 0,0 e 1,0. In questo caso, restituisce la matrice percentile approssimativa di column col in corrispondenza della matrice percentuale specificata.",
    "asin": "Restituisce il seno inverso (noto anche come seno arc) il sin dell'arco di expr, come se fosse calcolato da java.lang.Math.asin.",
    "atan": "Restituisce la tangente inversa (nota anche come tangente d'arco) di expr, come se fosse calcolata da java.lang.Math.atan",
    "avg": "Restituisce la media calcolata dai valori di un gruppo.",
    "casewhen": "Quando expr1 = true, restituisce expr2; else quando expr3 = true, restituisce expr4; else restituisce expr5. Argomenti: <br> expr1, expr3 - le espressioni della condizione di ramo devono essere tutte di tipo booleano. <br> expr2, expr4, expr5 - le espressioni del valore del ramo e l'espressione del valore else devono essere tutte dello stesso tipo o coercibili per un tipo comune.",
    "char_length": "Restituisce la lunghezza dei caratteri dei dati della stringa o il numero di byte dei dati binari. La lunghezza dei dati stringa include gli spazi finali. La lunghezza dei dati binari include gli zeri binari.",
    "coalesce": "Restituisce il primo argomento non null, se esiste. In caso contrario, null.",
    "concat": "Restituisce la concatenazione di col1, col2, ..., colN.",
    "cos": "Restituisce il coseno di expr, come se fosse calcolato da java.lang.Math.cos.",
    "current_date": "Restituisce la data corrente all'inizio della valutazione della query.",
    "current_timestamp": "Restituisce il timestamp corrente all'inizio della valutazione della query.",
    "date_add": "Restituisce la data num_days dopo start_date.",
    "date_sub": "Restituisce la data num_days prima di start_date.",
    "date_trunc": "Restituisce il timestamp ts troncato all'unità specificata dal modello di formato fmt. fmt dovrebbe essere uno di [\"ANNO\", \"AAAA\", \"AA\", \"LUN\", \"MESE\", \"MM\", \"GIORNO\", \"DD\", \"ORA\", \"MINUTO\", \"SECONDO\", \"SETTIMANA\", \"QUARTO\"]",
    "datediff": "Restituisce il numero di giorni da startDate a endDate.",
    "day": "Restituisce il giorno del mese della data/ora.",
    "dayofmonth": "Restituisce il giorno del mese della data/ora.",
    "dayofweek": "Restituisce il giorno della settimana per data/ora (1 = domenica, 2 = lunedì, ..., 7 = sabato).",
    "dayofyear": "Restituisce il giorno dell'anno della data/timestamp.",
    "dense_rank": "Calcola il rango di un valore in un gruppo di valori. Il risultato è uno più il valore di rango assegnato in precedenza. A differenza del rango di funzione, dense_rank non produrrà lacune nella sequenza di classificazione.",
    "element_at": "Restituisce l'elemento della matrice in un determinato indice (basato su 1). Se indice < 0, accesses elements from the last to the first. Returns NULL if the index exceeds the length of the array.",
    "element_at2": "Restituisce il valore per una determinata chiave o NULL se la chiave non è contenuta nella mappa",
    "exists": "Verifica se un predicato vale per uno o più elementi nella matrice.",
    "exp": "Restituisce e alla potenza di expr.",
    "factorial": "Restituisce il fattoriale di expr. expr è [0..20]. In caso contrario, null.",
    "floor": "Restituisce il numero intero più grande non maggiore di expr.",
    "format_string": "Restituisce una stringa formattata da stringhe di formato in stile printf.",
    "hint": "Fare clic su una delle funzioni elencate per ottenere maggiori informazioni al riguardo",
    "hour": "Restituisce il componente hour della stringa/timestamp.",
    "if": "Se expr1 restituisce true, restituisce expr2; in caso contrario, restituisce expr3.",
    "last_day": "Restituisce l'ultimo giorno del mese a cui appartiene la data.",
    "lcase": "Restituisce str con tutti i caratteri modificati in minuscolo.",
    "left": "Restituisce i caratteri len(len can be string type) più a sinistra dalla stringa str,se len è minore o uguale a 0 il risultato è una stringa vuota.",
    "length": "Restituisce la lunghezza dei caratteri dei dati della stringa o il numero di byte dei dati binari. La lunghezza dei dati stringa include gli spazi finali. La lunghezza dei dati binari include gli zeri binari.",
    "ln": "Restituisce il logaritmo naturale (base e) di expr.",
    "locate": "Restituisce la posizione della prima occorrenza di substr in str dopo la posizione pos. Il pos e il valore restituito specificati sono basati su 1.",
    "log": "Restituisce il logaritmo di expr con base.",
    "lower": "Restituisce str con tutti i caratteri modificati in minuscolo.",
    "lpad": "Ritorna str, imbottito a sinistra con pad ad una lunghezza di len. Se str è più lungo di len, il valore restituito viene abbreviato in caratteri len.",
    "ltrim1": "Rimuove i caratteri dello spazio iniziale da str.",
    "ltrim2": "Rimuove la stringa iniziale contenente i caratteri dalla stringa di ritaglio",
    "max": "Restituisce il valore massimo di expr",
    "mean": "Restituisce la media calcolata dai valori di un gruppo.",
    "min": "Restituisce il valore minimo di expr",
    "minute": "Restituisce il componente minuto della stringa/timestamp.",
    "mod": "Restituisce il resto dopo expr1/expr2.",
    "month": "Restituisce il componente mese della data/timestamp.",
    "months_between": "Se timestamp1 è successivo a timestamp2, il risultato è positivo. Se timestamp1 e timestamp2 si trovano nello stesso giorno del mese o entrambi sono l'ultimo giorno del mese, l'ora del giorno verrà ignorata. In caso contrario, la differenza viene calcolata in base a 31 giorni al mese e arrotondata a 8 cifre, a meno che roundOff=false.",
    "next_day": "Restituisce la prima data successiva a start_date e denominata come indicato.",
    "not": "Logico no.",
    "nullif": "Restituisce null se expr1 è uguale a expr2 o expr1 in caso contrario.",
    "nvl": "Restituisce expr2 se expr1 è null o expr1 in caso contrario.",
    "percent_rank": "Calcola la classificazione percentuale di un valore in un gruppo di valori.",
    "percentile1": "Restituisce il valore percentile esatto della colonna numerica col alla percentuale specificata. Il valore della percentuale deve essere compreso tra 0,0 e 1,0. Il valore della frequenza dovrebbe essere integrale positivo",
    "percentile2": "Restituisce l'esatta matrice di valori percentili della colonna numerica col in corrispondenza delle percentuali specificate. Ogni valore della matrice percentuale deve essere compreso tra 0,0 e 1,0. Il valore della frequenza dovrebbe essere integrale positivo",
    "pow": "Aumenta expr1 alla potenza di expr2.",
    "quarter1": "Restituisce il trimestre dell'anno per data, compreso tra 1 e 4.",
    "quarter2": "Restituisce il trimestre dell'anno per data, compreso tra 1 e 4.",
    "replace": "Sostituisce tutte le occorrenze della ricerca con sostituisci.",
    "round": "Restituisce expr arrotondato alle cifre decimali d utilizzando HALF_UP modalità di arrotondamento.",
    "rtrim1": "Rimuove i caratteri dello spazio finale da str.",
    "rtrim2": "Rimuove la stringa finale che contiene i caratteri dalla stringa di ritaglio dalla str",
    "second": "Restituisce il secondo componente della stringa/timestamp.",
    "sha": "Restituisce un valore hash sha1 come stringa esadecimale dell'expr.",
    "sin": "Restituisce il seno di expr, come se fosse calcolato da java.lang.Math.sin.",
    "skewness": "Restituisce il valore di inclinazione calcolato dai valori di un gruppo.",
    "stddev": "Restituisce la deviazione standard di esempio calcolata dai valori di un gruppo.",
    "stddev_pop": "Restituisce la deviazione standard della popolazione calcolata dai valori di un gruppo.",
    "stddev_samp": "Restituisce la deviazione standard di esempio calcolata dai valori di un gruppo.",
    "substr": "Restituisce la sottostringa di str che inizia da pos ed è di lunghezza len, oppure la fetta di matrice di byte che inizia da pos ed è di lunghezza len.",
    "tan": "Restituisce la tangente di expr, come se fosse calcolata da java.lang.Math.tan.",
    "timestamp": "Esegue il cast del valore expr al timestamp del tipo di dati di destinazione.",
    "to_date": "Analizza l'espressione date_str con l'espressione fmt in una data. Restituisce null con input non valido. Per impostazione predefinita, segue le regole di casting fino a una data se l'fmt viene omesso.",
    "to_timestamp": "Analizza l'espressione timestamp_str con l'espressione fmt in un timestamp. Restituisce null con input non valido. Per impostazione predefinita, segue le regole di casting a un timestamp se l'fmt viene omesso.",
    "trim": "trim(str) - Rimuove i caratteri dello spazio iniziale e finale da str. <br>        trim(BOTH trimStr FROM str) - Rimuovere i caratteri trimStr iniziali e finali da str <br>        trim(LEADING trimStr FROM str) - Rimuovere i caratteri trimStr iniziali da str <br>        trim(TRAILING trimStr FROM str) - Rimuovere i caratteri trimStr finali da str <br>        Argomenti: <br>        str - un'espressione stringa <br>        trimStr - i caratteri della stringa di ritaglio da tagliare, il valore predefinito è un singolo spazio <br>        BOTH, FROM - queste sono parole chiave per specificare il taglio dei caratteri stringa da entrambe le estremità della stringa <br>        LEADING, FROM - si tratta di parole chiave per specificare il taglio dei caratteri della stringa dall'estremità sinistra della stringa <br>        TRAILING, FROM - queste sono parole chiave per specificare il taglio dei caratteri stringa dall'estremità destra della stringa",
    "ucase": "Restituisce str con tutti i caratteri modificati in maiuscolo.",
    "upper": "Restituisce str con tutti i caratteri modificati in maiuscolo.",
    "variance": "Restituisce la varianza di esempio calcolata dai valori di un gruppo.",
    "weekday": "Restituisce il giorno della settimana per data/ora (0 = lunedì, 1 = martedì, ..., 6 = domenica).",
    "weekofyear": "Restituisce la settimana dell'anno della data specificata. Si considera che una settimana inizi il lunedì e la settimana 1 sia la prima settimana con >3 giorni.",
    "year": "Restituisce il componente anno della data/timestamp."
  }
}
