{
  "dataPreparation" : {
    "abs" : "Devuelve el valor absoluto del valor numérico. ",
    "acos" : "Devuelve el coseno inverso (alias arc cosine) de expr, como si se compute por java.lang.Math.acos. ",
    "add_months" : "Devuelve la fecha que es num_months después de start_date. ",
    "approx_percentile" : "Devuelve el percentil aproximado de la columna numérica col que es el valor más pequeño en los valores de col ordenados (ordenados de menor a mayor) de modo que no más de porcentaje de valores de col sea menor que el valor o igual a ese valor.  El valor de porcentaje debe estar entre 0.0 y 1.0.  El parámetro de precisión (valor por omisión: 10000) es un literal numérico positivo que controla la precisión de aproximación a costa de la memoria.  Un mayor valor de precisión produce una mayor precisión, 1.0/precisión es el error relativo de la aproximación.  Cuando el porcentaje es una matriz, cada valor de la matriz de porcentaje debe estar entre 0.0 y 1.0.  En este caso, devuelve la matriz de percentiles aproximada de la columna col en la matriz de porcentaje dada. ",
    "asin" : "Devuelve el seno inverso (alias arc sine) el pecado de arco de expr, como si lo compute java.lang.Mat.asin. ",
    "atan" : "Devuelve la tangente inversa (alias arc tangente) de expr, como si estuviera calculada por java.lang.Math.atan ",
    "avg" : "Devuelve la media calculada a partir de los valores de un grupo. ",
    "casewhen" : "Cuando expr1 = true, devuelve expr2; else cuando expr3 = true, devuelve expr4; else devuelve expr5.  Argumentos: <br> expr1, expr3-las expresiones de condición de rama deben ser de tipo booleano.  <br> expr2, expr4, expr5: las expresiones de valor de rama y la expresión de valor más deben ser del mismo tipo o coaccionables a un tipo común. ",
    "char_length" : "Devuelve la longitud de caracteres de los datos de serie o el número de bytes de datos binarios.  La longitud de los datos de serie incluye los espacios finales.  La longitud de los datos binarios incluye ceros binarios. ",
    "coalesce" : "Devuelve el primer argumento no nulo si existe.  De lo contrario, nulo. ",
    "concat" : "Devuelve la concatenación de col1, col2, ..., colN. ",
    "cos" : "Devuelve el coseno de expr, como si lo calcule java.lang.Math.cos. ",
    "current_date" : "Devuelve la fecha actual al inicio de la evaluación de la consulta. ",
    "current_timestamp" : "Devuelve la indicación de fecha y hora actual al inicio de la evaluación de consulta. ",
    "date_add" : "Devuelve la fecha que se num_days después de start_date. ",
    "date_sub" : "Devuelve la fecha num_days antes de start_date. ",
    "date_trunc" : "Devuelve la indicación de fecha y hora truncada en la unidad especificada por el modelo de formato fmt.  fmt debe ser uno de [\"YEAR\", \"AAAA\", \"AA\", \"MON\", \"MONTH\", \"MM\", \"DAY\", \"DD\", \"HOUR\", \"MINUTE\", \"SECOND\", \"WEEK\", \"TRIMESTRE\"] ",
    "datediff" : "Devuelve el número de días de startDate a endDate. ",
    "day" : "Devuelve el día del mes de la fecha/indicación de fecha y hora. ",
    "dayofmonth" : "Devuelve el día del mes de la fecha/indicación de fecha y hora. ",
    "dayofweek" : "Devuelve el día de la semana para la fecha/indicación de fecha y hora (1 = domingo, 2 = lunes, ..., 7 = sábado). ",
    "dayofyear" : "Devuelve el día del año de la fecha/indicación de fecha y hora. ",
    "dense_rank" : "Calcula el rango de un valor en un grupo de valores.  El resultado es uno más el valor de rango asignado anteriormente.  A diferencia del rango de función, dense_rank no producirá huecos en la secuencia de clasificación. ",
    "element_at" : "Devuelve el elemento de matriz en un determinado índice (basado en 1).  Si el índice < 0, accede a los elementos de la última a la primera.  Devuelve NULL si el índice supera la longitud de la matriz. ",
    "element_at2" : "Devuelve el valor para la clave dada, o NULL si la clave no está contenida en el mapa ",
    "exists" : "Prueba si un predicado contiene uno o más elementos en la matriz. ",
    "exp" : "Devuelve e a la potencia de expr. ",
    "factorial" : "Devuelve el factorial de expr.  expr es [0 .. 20]. De lo contrario, es nulo. ",
    "floor" : "Devuelve el entero más grande no mayor que expr. ",
    "format_string" : "Devuelve una serie formateada de series de formato de estilo printf. ",
    "hint" : "Pulse en una de las funciones de la lista para obtener más información al respecto ",
    "hour" : "Devuelve el componente de hora del string/timestamp. ",
    "if" : "Si expr1 se evalúa como true, devuelve expr2; de lo contrario, devuelve expr3. ",
    "last_day" : "Devuelve el último día del mes al que pertenece la fecha. ",
    "lcase" : "Devuelve str con todos los caracteres cambiados a minúsculas. ",
    "left" : "Devuelve los caracteres len (len pueden ser de tipo serie) más a la izquierda de la serie str, si len es menor o igual a 0 el resultado es una serie vacía. ",
    "length" : "Devuelve la longitud de caracteres de los datos de serie o el número de bytes de datos binarios.  La longitud de los datos de serie incluye los espacios finales.  La longitud de los datos binarios incluye ceros binarios. ",
    "ln" : "Devuelve el logaritmo natural (base e) de expr. ",
    "locate" : "Devuelve la posición de la primera aparición de substr en str después de la posición pos.  Los pos y el valor de retorno dados son 1-basados. ",
    "log" : "Devuelve el logaritmo de expr con base. ",
    "lower" : "Devuelve str con todos los caracteres cambiados a minúsculas. ",
    "lpad" : "Devuelve str, rellenado a la izquierda con almohadilla a una longitud de len.  Si str es más largo que len, el valor de retorno se reduce a los caracteres len. ",
    "ltrim1" : "Elimina los caracteres de espacio iniciales de str. ",
    "ltrim2" : "Elimina la serie principal que contiene los caracteres de la serie de recorte ",
    "max" : "Devuelve el valor máximo de expr ",
    "mean" : "Devuelve la media calculada a partir de los valores de un grupo. ",
    "min" : "Devuelve el valor mínimo de expr ",
    "minute" : "Devuelve el componente de minuto de la cadena/indicación de fecha y hora. ",
    "mod" : "Devuelve el resto después de expr1/expr2. ",
    "month" : "Devuelve el componente de mes de la fecha/fecha_hora. ",
    "months_between" : "Si la timestamp1 es posterior a la timestamp2, el resultado es positivo.  Si timestamp1 y timestamp2 están en el mismo día del mes, o ambos son el último día del mes, se ignorará la hora del día.  De lo contrario, la diferencia se calcula basándose en 31 días al mes, y redondeada a 8 dígitos a menos que se produzca un redondeo = falso. ",
    "next_day" : "Devuelve la primera fecha que es posterior a start_date y se denomina como se indica. ",
    "not" : "Lógico no. ",
    "nullif" : "Devuelve un valor nulo si expr1 es igual a expr2 o expr1 de lo contrario. ",
    "nvl" : "Devuelve expr2 si expr1 es nulo o expr1 de lo contrario. ",
    "percent_rank" : "Calcula el porcentaje de clasificación de un valor en un grupo de valores. ",
    "percentile1" : "Devuelve el valor de percentil exacto de la columna numérica col en el porcentaje dado.  El valor de porcentaje debe estar entre 0.0 y 1.0.  El valor de la frecuencia debe ser integral positivo ",
    "percentile2" : "Devuelve la matriz de valores de percentil exacto de columna numérica col en el porcentaje o porcentajes dados.  Cada valor de la matriz de porcentaje debe estar entre 0.0 y 1.0.  El valor de la frecuencia debe ser integral positivo ",
    "pow" : "Eleva el expr1 a la potencia de expr2. ",
    "quarter" : "Devuelve el trimestre del año para la fecha, en el rango de 1 a 4. ",
    "replace" : "Sustituye todas las apariciones de la búsqueda en sustitución. ",
    "round" : "Devuelve expr redondeado a d decimales utilizando la modalidad de redondeo HALF_UP. ",
    "rtrim1" : "Elimina los caracteres de espacio de cola de str. ",
    "rtrim2" : "Elimina la serie de cola que contiene los caracteres de la serie de recorte del str ",
    "second" : "Devuelve el segundo componente de la cadena/indicación de fecha y hora. ",
    "sha" : "Devuelve un valor hash sha1 como una serie hexadecimal del expr. ",
    "sin" : "Devuelve el seno de expr, como si estuviera calculado por java.lang.Math.sin. ",
    "skewness" : "Devuelve el valor de desvío calculado a partir de los valores de un grupo. ",
    "stddev" : "Devuelve la desviación estándar de ejemplo calculada a partir de los valores de un grupo. ",
    "stddev_pop" : "Devuelve la desviación estándar de población calculada a partir de los valores de un grupo. ",
    "stddev_samp" : "Devuelve la desviación estándar de ejemplo calculada a partir de los valores de un grupo. ",
    "substr" : "Devuelve la subserie de str que se inicia en pos y es de longitud len, o la porción de matriz de bytes que se inicia en pos y es de longitud len. ",
    "tan" : "Devuelve la tangente de expr, como si se calcula por java.lang.Mat.tan. ",
    "timestamp" : "Convierte el valor expr en la indicación de fecha y hora del tipo de datos destino. ",
    "to_date" : "Analiza la expresión date_str con la expresión fmt a una fecha.  Devuelve un valor nulo con entrada no válida.  De forma predeterminada, sigue las reglas de conversión a una fecha si se omite el fmt. ",
    "to_timestamp" : "Analiza la expresión timestamp_str con la expresión fmt en una indicación de fecha y hora.  Devuelve un valor nulo con entrada no válida.  De forma predeterminada, sigue las reglas de conversión a una indicación de fecha y hora si se omite el fmt. ",
    "trim" : "trim (str)-Elimina los caracteres de espacio iniciales y finales de str.  <br> trim (BOTH trimStr FROM str)-Eliminar los caracteres de trimStr iniciales y finales de str <br> trim (LIDERANDO trimStr FROM str)-Eliminar los caracteres de trimStr iniciales de str <br> trim (TRAILING trimStr FROM str)-Eliminar el  Los caracteres recortrStr de str <br> Argumentos: <br> str-una expresión de serie <br> trimStr-los caracteres de serie de recorte a recortar, el valor predeterminado es un solo espacio <br> BOTH, FROM-son palabras clave para especificar el recorte  caracteres de serie de ambos extremos de la serie <br> LIDERAR, FROM-son palabras clave para especificar caracteres de cadena de recorte del extremo izquierdo del  string <br> DETRING, FROM-estas son palabras clave para especificar caracteres de cadena de recorte desde el extremo derecho de la cadena ",
    "ucase" : "Devuelve str con todos los caracteres cambiados a mayúsculas. ",
    "upper" : "Devuelve str con todos los caracteres cambiados a mayúsculas. ",
    "variance" : "Devuelve la varianza de muestra calculada a partir de los valores de un grupo. ",
    "weekday" : "Devuelve el día de la semana para la fecha/indicación de fecha y hora (0 = lunes, 1 = martes, ..., 6 = domingo). ",
    "weekofyear" : "Devuelve la semana del año de la fecha indicada.  Se considera que una semana comienza el lunes y la semana 1 es la primera semana con > 3 días. ",
    "year" : "Devuelve el componente de año de la fecha/fecha_hora."
  }
}