{
  "dataPreparation" : {
    "abs" : "Returnerer den absolutte værdi af den numeriske værdi. ",
    "acos" : "Returnerer den inverse cosinus (.k.a. arcus cosinus) for expr, som om det er beregnet af java.lang.Math.acos. ",
    "add_months" : "Returnerer den dato, der er num_months efter start_date. ",
    "approx_percentile" : "Returnerer den omtrentlige percentil for den numeriske kolonnekolonne, som er den mindste værdi i de sorterede col-værdier (sorteret fra mindst til største), så der ikke er mindre end værdien eller lig med den værdi, der er mindre end værdien eller lig med værdien.  Værdien af procentdelen skal være mellem 0,0 og 1.0.  Nøjagtighedsparameter (standard: 10000) er en positiv numerisk tegnstreng, som kontrollerer nøjagtigheden på bekostning af hukommelsen.  Højere værdi af nøjagtighed giver bedre nøjagtighed, 1.0/nøjagtighed er den relative fejl i forbindelse med tilnærmelsen.  Når procentdelen er et array, skal hver værdi af arrayet være mellem 0,0 og 1,0.  I dette tilfælde returnerer den omtrentlige procentdel af kolonnekolonnen i det givne procentarray. ",
    "asin" : "Returnerer den inverse sinus (a.k.a. arsk sinus) den arktiske sinsin of expr, som om beregnet af java.lang.Math.asin. ",
    "atan" : "Returnerer den omvendte tangens (a.k.a. arc tangens) of expr, som om beregnet af java.lang.Math.atan ",
    "avg" : "Returnerer den gennemsnitlige beregnede værdi af værdier for en gruppe. ",
    "casewhen" : "When expr1 = true, returnerer expr2 ; else, når expr3 = true, returnerer expr4 ; else returnerer expr5.  Argumenter: <br> expr1, expr3-branchebetingelsesudtryk bør alle være boolesk type.  <br> expr2, expr4, expr5-the branch value udtryk and else value should all be same type or coercible to a common type. ",
    "char_length" : "Returnerer tegnlængden på strengdata eller antallet af byte i binære data.  Længden på strengdata omfatter de efterfølgende blanktegn.  Længden på binære data omfatter binære nuller. ",
    "coalesce" : "Returnerer det første argument, der ikke er NULL, hvis det findes.  Ellers er det NULL. ",
    "concat" : "Returnerer sammenkædning af kol1, kol2, ..., colN. ",
    "cos" : "Returnerer cosinus for expr, som om det er beregnet af java.lang.Math.cos. ",
    "current_date" : "Returnerer den aktuelle dato ved starten af forespørgselsevalueringen. ",
    "current_timestamp" : "Returnerer det aktuelle tidsstempel ved starten af forespørgselsevalueringen. ",
    "date_add" : "Returnerer den dato, der er num_days efter start_date. ",
    "date_sub" : "Returnerer den dato, der er num_days før start_date. ",
    "date_trunc" : "Returnerer tidsstempel, der er afkortet til den enhed, der er angivet i formatet model FMt.  fmt skal være en af [ \"YEAR\", \"YYYY\", \"Y\", \"MON\", \"MONTH\", \"MM\", \"DD\", \"DD\", \"MINUTE\", \"SECOND\", \"WEEK\", \"QUARTER\" ] ",
    "datediff" : "Returnerer antallet af dage fra startDate til endDate. ",
    "day" : "Returnerer dagen i måneden for dato / tidsstempel. ",
    "dayofmonth" : "Returnerer dagen i måneden for dato / tidsstempel. ",
    "dayofweek" : "Returnerer dagen i ugen for dato / tidsstempel (1 = Søndag, 2 = mandag, ..., 7 = Lørdag). ",
    "dayofyear" : "Returnerer dagen for året for dato / tidsstempel. ",
    "dense_rank" : "Beregner rangen af en værdi i en gruppe værdier.  Resultatet er en plus den tidligere tildelte rangen værdi.  I modsætning til funktionsrækkefølgen vil dense_menige ikke skabe huller i prioriteringsrækkefølgen. ",
    "element_at" : "Returnerer delelement for et array på givet (1-baseret) indeks.  Hvis indeks < 0, får adgang til elementer fra den sidste til den første.  Returnerer NULL, hvis indekset overskrider længden på arrayet. ",
    "element_at2" : "Returnerer værdien for givet nøgle, eller NULL, hvis nøglen ikke er indeholdt i kortet ",
    "exists" : "Tester, om et prædikat indeholder for et eller flere elementer i arrayet. ",
    "exp" : "Returnerer e til kraften for expr. ",
    "factorial" : "Returnerer fakultetsværdien for expr.  expr er [ 0 .. 20 ]. Ellers er det NULL. ",
    "floor" : "Returnerer det største heltal, der ikke er større end expr. ",
    "format_string" : "Returnerer en formateret streng fra formatstrenge for printf-format. ",
    "hint" : "Klik på en af de viste funktioner for at få flere oplysninger om det ",
    "hour" : "Returnerer timekomponenten for streng/tidsstemplet. ",
    "if" : "Hvis expr1 evalueres til sand, returneres expr2. Ellers returneres expr3. ",
    "last_day" : "Returnerer den sidste dag i måneden, som datoen tilhører. ",
    "lcase" : "Returnerer str med alle tegn ændret til små bogstaver. ",
    "left" : "Returnerer den længst venstre, der kan være strengtype (strengtype) fra strengen str, hvis Llen er mindre eller lig med 0, er resultatet en tom streng. ",
    "length" : "Returnerer tegnlængden på strengdata eller antallet af byte i binære data.  Længden på strengdata omfatter de efterfølgende blanktegn.  Længden på binære data omfatter binære nuller. ",
    "ln" : "Returnerer den naturlige logaritme (basis e) af expr. ",
    "locate" : "Returnerer positionen for den første forekomst af substr i str efter position pos.  Den angivne pos-og returværdi er 1-baseret. ",
    "log" : "Returnerer logaritmen for expr med basis. ",
    "lower" : "Returnerer str med alle tegn ændret til små bogstaver. ",
    "lpad" : "Returnerer str, efterladt-ptilføjet med blok til en længde på len.  Hvis str er længere end Llen, er returværdien forkortet til et antal tegn. ",
    "ltrim1" : "Fjerner de foranstillede mellemrumstegn fra str. ",
    "ltrim2" : "Fjerner den forreste streng med tegnene fra trimstrengen ",
    "max" : "Returnerer den maksimale værdi af expr ",
    "mean" : "Returnerer den gennemsnitlige beregnede værdi af værdier for en gruppe. ",
    "min" : "Returnerer den mindste værdi for expr ",
    "minute" : "Returnerer minutkomponenten for streng/tidsstemplet. ",
    "mod" : "Returnerer resten efter expr1/expr2. ",
    "month" : "Returnerer månedskomponenten for dato / tidsstempel. ",
    "months_between" : "Hvis tidsstempel1 er senere end tidsstempel2, er resultatet positivt.  Hvis tidsstempler 1 og timestamp2 er på den samme dag i måneden, eller begge er den sidste dag i måneden, ignoreres tidspunktet for dagen.  I modsat fald beregnes forskellen på basis af 31 dage om måneden og afrundes til 8 cifre, medmindre RoundOff = false. ",
    "next_day" : "Returnerer den første dato, der er senere end start_date og navngivet som angivet. ",
    "not" : "Logisk ikke. ",
    "nullif" : "Returnerer NULL, hvis expr1 er lig med expr2 eller expr1 på anden måde. ",
    "nvl" : "Returnerer expr2, hvis expr1 er NULL, eller expr1 på anden måde. ",
    "percent_rank" : "Beregner den procentvise prioritering af en værdi i en gruppe af værdier. ",
    "percentile1" : "Returnerer den nøjagtige procentværdi for numerisk kolonnekolonne i den givne procentdel.  Værdien af procentdelen skal være mellem 0,0 og 1.0.  Værdien af frekvensen skal være en positiv integrerende værdi ",
    "percentile2" : "Returnerer den nøjagtige percentil-værdi for numerisk kolonnekol for den givne procentdel (r).  Hver værdi for arrayet skal være mellem 0,0 og 1.0.  Værdien af frekvensen skal være en positiv integrerende værdi ",
    "pow" : "Løfter udpensl til forpr2. ",
    "quarter1" : "Returnerer kvartalet i året for dato i intervallet 1 til 4. ",
    "quarter2" : "Returnerer kvartalet i året for dato i intervallet 1 til 4. ",
    "replace" : "Erstatter alle forekomster af søgning med erstatning. ",
    "round" : "Returnerer expr afrundet til d decimaler, der anvender HALF_UP afrundingstilstand. ",
    "rtrim1" : "Fjerner de efterstillede mellemrumstegn fra str. ",
    "rtrim2" : "Fjerner den efterstillede streng, som indeholder tegnene fra strengen fra str. ",
    "second" : "Returnerer den anden komponent af streng/tidsstemplet. ",
    "sha" : "Returnerer en sha1-hashværdi som en hex-streng på expr-strengen. ",
    "sin" : "Returnerer sinus for expr, som om det er beregnet af java.lang.Math.sin. ",
    "skewness" : "Returnerer den skævhedsværdi, der er beregnet ud fra værdier for en gruppe. ",
    "stddev" : "Returnerer stikprøvestandardafvigelsen beregnet fra værdier i en gruppe. ",
    "stddev_pop" : "Returnerer den standardafvigelse for populationen, der er beregnet ud fra værdier for en gruppe. ",
    "stddev_samp" : "Returnerer stikprøvestandardafvigelsen beregnet fra værdier i en gruppe. ",
    "substr" : "Returnerer den substreng af str, der starter ved pos og er af længde len, eller et stykke af bytearrayet, der starter ved pos. og er af længde len. ",
    "tan" : "Returnerer tangens for expr, som om det er beregnet af java.lang.Math.tan. ",
    "timestamp" : "Konverter værdien udtryk til måldatatypen tidsstempel. ",
    "to_date" : "Analyserer dato_str-udtrykket med dmt-udtrykket til en dato.  Returnerer NULL med ugyldigt input.  Som standard følger denne casting-regler til en dato, hvis fmt er udeladt. ",
    "to_timestamp" : "Analyserer timestamp_str-udtrykket med et tidsstempel for et udtryk.  Returnerer NULL med ugyldigt input.  Som standard følger den en konvertering af regler til et tidsstempel, hvis fmset er udeladt. ",
    "trim" : "trim (str)-Fjerner de foranstillede og efterstillede mellemrumstegn fra str.  <br> trim (BOTH TrimStr FROM str)-Fjern foranstillede og efterstillede trimStr-tegn fra str <br> trim (LEADING TrimStr FROM str)-Fjern de førende trimStr-tegn fra str <br> trim (TRAILING TrimStr FROM str)-Fjern de  efterfølgende trimStr-tegn fra str <br> Argumenter: <br> str-a string udtryk <br> trimStr-the Trim string tegn to trim, the default value is a single space <br> BOTH, FROM-Disse er nøgleord for at angive trimning.  Strengtegn fra begge ender af strengen <br> LEADING, FRA-disse er nøgleord for at angive beskæmningsstrengtegn fra venstre side af det venstre.  strengen <br> TRAILING, FRA-disse er nøgleord for at angive beskæmningsstrengtegn fra højre side af strengen ",
    "ucase" : "Returnerer str med alle tegn ændret til store bogstaver. ",
    "upper" : "Returnerer str med alle tegn ændret til store bogstaver. ",
    "variance" : "Returnerer stikprøvevariansen beregnet fra værdier i en gruppe. ",
    "weekday" : "Returnerer dagen i ugen for dato / tidsstempel (0 = mandag, 1 = Tirsdag, ..., 6 = Søndag). ",
    "weekofyear" : "Returnerer ugen for året for den angivne dato.  En uge anses for at starte på en mandag, og uge 1 er den første uge med > 3 dage. ",
    "year" : "Returnerer årskomponenten for dato / tidsstempel."
  }
}