{
  "dataPreparation": {
    "abs": "Возвращает абсолютное значение числового значения.",
    "acos": "Возвращает обратный косинус (он же дуговой косинус) expr, как если бы он был вычислен java.lang.Math.acos.",
    "add_months": "Возвращает дату, num_months после start_date.",
    "approx_percentile": "Возвращает приблизительный процентиль числового столбца col, который является наименьшим значением в упорядоченных значениях col (отсортированных от наименьшего до наибольшего), так что не более процента значений col меньше значения или равно этому значению. Значение процента должно быть в диапазоне от 0,0 до 1,0. Параметр точности (по умолчанию: 10000) представляет собой положительный числовой литерал, который управляет точностью приближения за счет памяти. Более высокое значение точности дает лучшую точность, 1,0 / точность - относительная погрешность приближения. Если процент является массивом, каждое значение массива процентов должно быть в диапазоне от 0,0 до 1,0. В этом случае возвращает приблизительный процентильный массив столбца col в заданном процентном массиве.",
    "asin": "Возвращает обратный синус (он же дуговой синус) дуговой грех expr, как если бы он был вычислен java.lang.Math.asin.",
    "atan": "Возвращает обратный тангенс (он же дуговой тангенс) expr, как если бы он был вычислен java.lang.Math.atan",
    "avg": "Возвращает среднее значение, вычисляемое из значений группы.",
    "casewhen": "Если expr1 = true, возвращает expr2; else, когда expr3 = true, возвращает expr4; else возвращает expr5. Аргументы: <br> expr1, expr3 - все выражения условия ветви должны быть логическим типом. <br> expr2, expr4, expr5 - выражения значения ветви и иначе значения должны быть одного типа или принуждаться к общему типу.",
    "char_length": "Возвращает символьную длину строковых данных или количество байтов двоичных данных. Длина строковых данных включает конечные пробелы. Длина двоичных данных включает двоичные нули.",
    "coalesce": "Возвращает первый аргумент, отличный от null, если он существует. В противном случае — значение null.",
    "concat": "Возвращает конкатенацию col1, col2, ..., colN.",
    "cos": "Возвращает косинус expr, как если бы он был вычислен java.lang.Math.cos.",
    "current_date": "Возвращает текущую дату в начале оценки запроса.",
    "current_timestamp": "Возвращает текущую метку времени в начале оценки запроса.",
    "date_add": "Возвращает дату, num_days после start_date.",
    "date_sub": "Возвращает дату, num_days перед start_date.",
    "date_trunc": "Возвращает метку времени ts, усеченную до единицы измерения, заданной моделью формата fmt. fmt должен быть одним из [\"ГОД\", \"ГГГГ\", \"ГГ\", \"МОН\", \"МЕСЯЦ\", \"ММ\", \"ДЕНЬ\", \"ДД\", \"ЧАС\", \"МИНУТА\", \"ВТОРОЙ\", \"НЕДЕЛЯ\", \"КВАРТАЛ\"]",
    "datediff": "Возвращает количество дней от startDate до endDate.",
    "day": "Возвращает день месяца для метки даты и времени.",
    "dayofmonth": "Возвращает день месяца для метки даты и времени.",
    "dayofweek": "Возвращает день недели для отметки даты/времени (1 = воскресенье, 2 = понедельник, ..., 7 = суббота).",
    "dayofyear": "Возвращает день года метки даты и времени.",
    "dense_rank": "Вычисляет ранг значения в группе значений. Результатом является один плюс ранее присвоенное значение ранга. В отличие от ранга функции, dense_rank не будет создавать пробелов в последовательности ранжирования.",
    "element_at": "Возвращает элемент массива по заданному (на основе 1) индексу. Если индекс < 0, accesses elements from the last to the first. Returns NULL if the index exceeds the length of the array.",
    "element_at2": "Возвращает значение для заданного ключа или NULL, если ключ не содержится в карте.",
    "exists": "Проверяет, содержится ли предикат для одного или нескольких элементов массива.",
    "exp": "Возвращает e в степень expr.",
    "factorial": "Возвращает факториал expr. expr [0..20]. В противном случае — значение null.",
    "floor": "Возвращает наибольшее целое число, не превышающее expr.",
    "format_string": "Возвращает отформатированную строку из строк формата printf.",
    "hint": "Нажмите на одну из перечисленных функций, чтобы получить более подробную информацию о ней",
    "hour": "Возвращает часовой компонент строки/метки времени.",
    "if": "Если expr1 вычисляет значение true, то возвращает expr2; в противном случае возвращает expr3.",
    "last_day": "Возвращает последний день месяца, к которому принадлежит дата.",
    "lcase": "Возвращает str со всеми символами, измененными на строчные буквы.",
    "left": "Возвращает крайние левые символы len(len может быть строковым типом) из строки str, если len меньше или равно 0, результатом является пустая строка.",
    "length": "Возвращает символьную длину строковых данных или количество байтов двоичных данных. Длина строковых данных включает конечные пробелы. Длина двоичных данных включает двоичные нули.",
    "ln": "Возвращает натуральный логарифм (основание e) expr.",
    "locate": "Возвращает положение первого вхождения подстроки в str после позиции pos. Заданные значения pos и return основаны на 1.",
    "log": "Возвращает логарифм expr с основанием.",
    "lower": "Возвращает str со всеми символами, измененными на строчные буквы.",
    "lpad": "Возвращает str, левую подкладку с накладкой на длину len. Если str длиннее len, возвращаемое значение сокращается до символов len.",
    "ltrim1": "Удаляет символы начального пробела из str.",
    "ltrim2": "Удаляет начальную строку, содержащую символы, из строки обрезки",
    "max": "Возвращает максимальное значение expr.",
    "mean": "Возвращает среднее значение, вычисляемое из значений группы.",
    "min": "Возвращает минимальное значение expr.",
    "minute": "Возвращает минутный компонент строки/метки времени.",
    "mod": "Возвращает остаток после expr1/expr2.",
    "month": "Возвращает компонент месяца метки даты и времени.",
    "months_between": "Если метка времени1 позже метки времени2, то результат положительный. Если метка времени1 и метка времени2 находятся в одном и том же дне месяца или оба являются последним днем месяца, время суток будет проигнорировано. В противном случае разница вычисляется на основе 31 дня в месяц и округляется до 8 цифр, если roundOff=false.",
    "next_day": "Возвращает первую дату, которая является более поздней, чем start_date и названной, как указано.",
    "not": "Логично нет.",
    "nullif": "Возвращает значение null, если expr1 равен expr2 или expr1 в противном случае.",
    "nvl": "Возвращает expr2, если значение expr1 равно null, или expr1 в противном случае.",
    "percent_rank": "Вычисляет процентное ранжирование значения в группе значений.",
    "percentile1": "Возвращает точное процентильное значение числового столбца col при заданном проценте. Значение процента должно быть в диапазоне от 0,0 до 1,0. Значение частоты должно быть положительным интегралом",
    "percentile2": "Возвращает массив точных процентильных значений числового столбца col при заданных процентах. Каждое значение массива процентов должно быть в диапазоне от 0,0 до 1,0. Значение частоты должно быть положительным интегралом",
    "pow": "Возводит expr1 во власть expr2.",
    "quarter": "Возвращает квартал года для даты в диапазоне от 1 до 4.",
    "replace": "Заменяет все вхождения поиска на replace.",
    "round": "Возвращает expr с округлением до d десятичных знаков с использованием HALF_UP режима округления.",
    "rtrim1": "Удаляет символы замыкающего пробела из str.",
    "rtrim2": "Удаляет конечную строку, содержащую символы из строки обрезки, из str",
    "second": "Возвращает второй компонент строки/метки времени.",
    "sha": "Возвращает хэш-значение sha1 в виде шестнадцатеричной строки expr.",
    "sin": "Возвращает синус expr, как если бы он был вычислен java.lang.Math.sin.",
    "skewness": "Возвращает значение асимметрии, вычисляемое из значений группы.",
    "stddev": "Возвращает выборку стандартного отклонения, рассчитанную по значениям группы.",
    "stddev_pop": "Возвращает стандартное отклонение популяции, рассчитанное по значениям группы.",
    "stddev_samp": "Возвращает выборку стандартного отклонения, рассчитанную по значениям группы.",
    "substr": "Возвращает подстроку str, которая начинается с pos и имеет длину len, или фрагмент массива байтов, который начинается с pos и имеет длину len.",
    "tan": "Возвращает касательную expr, как если бы она была вычислена java.lang.Math.tan.",
    "timestamp": "Преобразует значение expr в метку времени целевого типа данных.",
    "to_date": "Анализирует выражение date_str с выражением fmt до даты. Возвращает значение null с недопустимым вводом. По умолчанию он следует правилам приведения к дате, если fmt опущен.",
    "to_timestamp": "Анализирует выражение timestamp_str с выражением fmt до метки времени. Возвращает значение null с недопустимым вводом. По умолчанию он следует правилам приведения к метке времени, если fmt опущен.",
    "trim": "trim(str) — удаляет символы начального и заключительного пробелов из str. <br>        trim(ОБА trimStr FROM str) - Удалите начальные и конечные символы trimStr из str <br>        trim(LEADING trimStr FROM str) - Удаление ведущих символов trimStr из str <br>        trim(TRAILING trimStr FROM str) - Удаление замыкающих символов trimStr из str <br>        Аргументы: <br>        str - строковое выражение <br>        trimStr - обрезать строковые символы для обрезки, значением по умолчанию является один пробел <br>        ОБА, FROM - это ключевые слова для указания обрезки строковых символов с обоих концов строки <br>        LEADING, FROM - это ключевые слова для указания обрезки строковых символов из левого конца строки <br>        TRAILING, FROM - это ключевые слова для указания обрезки строковых символов из правого конца строки",
    "ucase": "Возвращает str со всеми символами, измененными на прописные.",
    "upper": "Возвращает str со всеми символами, измененными на прописные.",
    "variance": "Возвращает выборочную дисперсию, рассчитанную по значениям группы.",
    "weekday": "Возвращает день недели для даты/времени (0 = понедельник, 1 = вторник, ..., 6 = воскресенье).",
    "weekofyear": "Возвращает неделю года заданной даты. Считается, что неделя начинается в понедельник, а неделя 1 - это первая неделя с >3 дня.",
    "year": "Возвращает компонент года метки даты и времени."
  }
}
