{
  "dataPreparation": {
    "abs": "Gibt den absoluten Wert des numerischen Werts zurück.",
    "acos": "Gibt den inversen Kosinus (auch Bogenkosinus genannt) von expr zurück, als ob er von java.lang.Math.acos berechnet würde.",
    "add_months": "Gibt das Datum zurück, das nach start_date num_months ist.",
    "approx_percentile": "Gibt das ungefähre Perzentil der numerischen Spalte zurück, das der kleinste Wert in den geordneten Spaltenwerten (sortiert vom kleinsten zum größten) ist, sodass nicht mehr als der Prozentsatz der Spaltenwerte kleiner als der Wert oder gleich diesem Wert ist. Der Wert des Prozentsatzes muss zwischen 0,0 und 1,0 liegen. Der Genauigkeitsparameter (Standard: 10000) ist ein positives numerisches Literal, das die Näherungsgenauigkeit auf Kosten des Speichers steuert. Ein höherer Wert der Genauigkeit führt zu einer besseren Genauigkeit, 1,0 / Genauigkeit ist der relative Fehler der Näherung. Wenn percentage ein Array ist, muss jeder Wert des Prozentarrays zwischen 0,0 und 1,0 liegen. Gibt in diesem Fall das ungefähre Perzentilarray der Spalte col am angegebenen Prozentarray zurück.",
    "asin": "Gibt den inversen Sinus (auch bekannt als Bogensinus) die Bogensünde von expr zurück, als ob sie von java.lang.Math.asin berechnet würde.",
    "atan": "Gibt die inverse Tangente (auch bekannt als Bogentangente) von expr zurück, als ob sie von java.lang.Math.atan berechnet würde",
    "avg": "Gibt den Mittelwert zurück, der aus den Werten einer Gruppe berechnet wurde.",
    "casewhen": "Wenn expr1 = true ist, gibt expr2 zurück; else wenn expr3 = true ist, gibt expr4 zurück; else gibt expr5 zurück. Argumente: <br> expr1, expr3 - Die Zweigbedingungsausdrücke sollten alle boolescher Typ sein. <br> expr2, expr4, expr5 - Die Zweigwertausdrücke und der ELSE-Wertausdruck sollten alle vom gleichen Typ sein oder zu einem gemeinsamen Typ erzwungen werden können.",
    "char_length": "Gibt die Zeichenlänge von Zeichenfolgendaten oder die Anzahl der Bytes von Binärdaten zurück. Die Länge von Zeichenfolgendaten schließt die nachgestellten Leerzeichen ein. Die Länge von Binärdaten umfasst binäre Nullen.",
    "coalesce": "Gibt das erste Argument ungleich null zurück, falls vorhanden. Andernfalls null.",
    "concat": "Gibt die Verkettung von col1, col2, ..., colN zurück.",
    "cos": "Gibt den Kosinus von expr zurück, als ob er von java.lang.Math.cos berechnet würde.",
    "current_date": "Gibt das aktuelle Datum zu Beginn der Abfrageauswertung zurück.",
    "current_timestamp": "Gibt den aktuellen Zeitstempel zu Beginn der Abfrageauswertung zurück.",
    "date_add": "Gibt das Datum zurück, das nach start_date num_days ist.",
    "date_sub": "Gibt das Datum zurück, das vor start_date num_days liegt.",
    "date_trunc": "Gibt Zeitstempel ts abgeschnitten auf die Einheit zurück, die im Formatmodell fmt angegeben ist. fmt sollte eines von [\"YEAR\", \"YYYY\", \"YY\", \"MON\", \"MONTH\", \"MM\", \"DAY\", \"DD\", \"HOUR\", \"MINUTE\", \"SECOND\", \"WEEK\", \"QUARTER\"] SEIN.",
    "datediff": "Gibt die Anzahl der Tage von startDate bis endDate zurück.",
    "day": "Gibt den Monatstag des Datums-/Zeitstempels zurück.",
    "dayofmonth": "Gibt den Monatstag des Datums-/Zeitstempels zurück.",
    "dayofweek": "Gibt den Wochentag für Datum/Zeitstempel zurück (1 = Sonntag, 2 = Montag, ..., 7 = Samstag).",
    "dayofyear": "Gibt den Tag des Jahres des Datums-/Zeitstempels zurück.",
    "dense_rank": "Berechnet den Rang eines Werts in einer Gruppe von Werten. Das Ergebnis ist eins plus der zuvor zugewiesene Rangwert. Im Gegensatz zum Funktionsrang erzeugt dense_rank keine Lücken in der Rangfolge.",
    "element_at": "Gibt das Element des Arrays bei einem gegebenen (1-basierten) Index zurück. Wenn Index < 0, accesses elements from the last to the first. Returns NULL if the index exceeds the length of the array.",
    "element_at2": "Gibt den Wert für einen bestimmten Schlüssel oder NULL zurück, wenn der Schlüssel nicht in der Zuordnung enthalten ist.",
    "exists": "Überprüft, ob ein Prädikat für ein oder mehrere Elemente im Array gilt.",
    "exp": "Gibt e zur Potenz von expr zurück.",
    "factorial": "Gibt den faktoriellen Wert expr zurück. expr ist [0..20]. Andernfalls null.",
    "floor": "Gibt die größte ganze Zahl zurück, die nicht größer als expr ist.",
    "format_string": "Gibt eine formatierte Zeichenfolge aus formatierten Formatzeichenfolgen im printf-Stil zurück.",
    "hint": "Klicken Sie auf eine der aufgeführten Funktionen, um weitere Informationen darüber zu erhalten",
    "hour": "Gibt die Stundenkomponente der Zeichenfolge/des Zeitstempels zurück.",
    "if": "Wenn expr1 als true ausgewertet wird, gibt expr2 zurück. andernfalls wird expr3 zurückgegeben.",
    "last_day": "Gibt den letzten Tag des Monats zurück, zu dem das Datum gehört.",
    "lcase": "Gibt str zurück, wobei alle Zeichen in Kleinbuchstaben geändert wurden.",
    "left": "Gibt die Zeichen ganz links aus der Zeichenfolge str zurück, wenn len kleiner oder gleich 0 ist, ist das Ergebnis eine leere Zeichenfolge.",
    "length": "Gibt die Zeichenlänge von Zeichenfolgendaten oder die Anzahl der Bytes von Binärdaten zurück. Die Länge von Zeichenfolgendaten schließt die nachgestellten Leerzeichen ein. Die Länge von Binärdaten umfasst binäre Nullen.",
    "ln": "Gibt den natürlichen Logarithmus (Basis e) von expr zurück.",
    "locate": "Gibt die Position des ersten Auftretens von substr in str nach der Position pos zurück. Der angegebene pos- und Rückgabewert basiert auf 1.",
    "log": "Gibt den Logarithmus von expr mit base zurück.",
    "lower": "Gibt str zurück, wobei alle Zeichen in Kleinbuchstaben geändert wurden.",
    "lpad": "Gibt str, linksgepolstert mit Pad auf eine Länge von Len zurück. Wenn str länger als len ist, wird der Rückgabewert auf len-Zeichen verkürzt.",
    "ltrim1": "Entfernt die führenden Leerzeichenzeichen aus str.",
    "ltrim2": "Entfernt die führende Zeichenfolge, die die Zeichen enthält, aus der Trimmzeichenfolge",
    "max": "Gibt den maximalen Wert von expr zurück.",
    "mean": "Gibt den Mittelwert zurück, der aus den Werten einer Gruppe berechnet wurde.",
    "min": "Gibt den Mindestwert expr zurück.",
    "minute": "Gibt die Minutenkomponente der Zeichenfolge/des Zeitstempels zurück.",
    "mod": "Gibt den Rest nach expr1/expr2 zurück.",
    "month": "Gibt die Monatskomponente des Datums-/Zeitstempels zurück.",
    "months_between": "Wenn timestamp1 später als timestamp2 ist, ist das Ergebnis positiv. Wenn timestamp1 und timestamp2 am selben Tag des Monats oder beide am letzten Tag des Monats sind, wird die Uhrzeit ignoriert. Andernfalls wird die Differenz basierend auf 31 Tagen pro Monat berechnet und auf 8 Ziffern gerundet, es sei denn, roundOff=false.",
    "next_day": "Gibt das erste Datum zurück, das nach start_date liegt und wie angegeben benannt ist.",
    "not": "Logisch nicht.",
    "nullif": "Gibt null zurück, wenn expr1 gleich expr2 ist, andernfalls expr1.",
    "nvl": "Gibt expr2 zurück, wenn expr1 null ist, oder expr1 anderweitig.",
    "percent_rank": "Berechnet die prozentuale Rangfolge eines Werts in einer Gruppe von Werten.",
    "percentile1": "Gibt den exakten Perzentilwert der numerischen Spaltenspalte zum angegebenen Prozentsatz zurück. Der Wert des Prozentsatzes muss zwischen 0,0 und 1,0 liegen. Der Wert der Frequenz sollte positiv integral sein",
    "percentile2": "Gibt das exakte Perzentilwertarray der numerischen Spalte bei den angegebenen Prozentsätzen zurück. Jeder Wert des Prozentarrays muss zwischen 0,0 und 1,0 liegen. Der Wert der Frequenz sollte positiv integral sein",
    "pow": "Erhöht expr1 auf die Potenz von expr2.",
    "quarter": "Gibt das Quartal des Jahres zum Datum im Bereich von 1 bis 4 zurück.",
    "replace": "Ersetzt alle Vorkommen der Suche durch ersetzen.",
    "round": "Gibt expr gerundet auf d Dezimalstellen im HALF_UP Rundungsmodus zurück.",
    "rtrim1": "Entfernt die nachgestellten Leerzeichen aus str.",
    "rtrim2": "Entfernt die nachgestellte Zeichenfolge, die die Zeichen enthält, aus der Trimmzeichenfolge aus dem str",
    "second": "Gibt die zweite Komponente der Zeichenfolge/des Zeitstempels zurück.",
    "sha": "Gibt einen sha1-Hashwert als Hex-Zeichenfolge des expr zurück.",
    "sin": "Gibt den Sinus von expr zurück, als ob er von java.lang.Math.sin berechnet würde.",
    "skewness": "Gibt den Neigungswert zurück, der aus Werten einer Gruppe berechnet wird.",
    "stddev": "Gibt die aus Werten einer Gruppe berechnete Beispielstandardabweichung zurück.",
    "stddev_pop": "Gibt die Standardabweichung der Grundgesamtheit zurück, die aus Werten einer Gruppe berechnet wird.",
    "stddev_samp": "Gibt die aus Werten einer Gruppe berechnete Beispielstandardabweichung zurück.",
    "substr": "Gibt die Teilzeichenfolge von str zurück, die bei pos beginnt und die Länge len hat, oder den Slice des Bytearrays, der bei pos beginnt und die Länge len hat.",
    "tan": "Gibt die Tangente von expr zurück, als ob sie von java.lang.Math.tan berechnet würde.",
    "timestamp": "Wandelt den Wert expr in den Zeitstempel des Zieldatentyps um.",
    "to_date": "Analysiert den date_str Ausdruck mit dem fmt-Ausdruck auf ein Datum. Gibt null mit ungültiger Eingabe zurück. Standardmäßig werden die Umwandlungsregeln bis zu einem Datum befolgt, wenn die fmt weggelassen wird.",
    "to_timestamp": "Analysiert den timestamp_str Ausdruck mit dem fmt-Ausdruck zu einem Zeitstempel. Gibt null mit ungültiger Eingabe zurück. Standardmäßig werden Umwandlungsregeln bis zu einem Zeitstempel befolgt, wenn die fmt weggelassen wird.",
    "trim": "trim(str) - Entfernt die führenden und nachgestellten Leerzeichen aus str. <br>        trim (BEIDE trimStr FROM str) - Entfernen Sie die führenden und nachgestellten trimStr-Zeichen aus str <br>        trim (LEADING trimStr FROM str) - Entfernen Sie die führenden trimStr-Zeichen aus str <br>        trim (TRAILING trimStr FROM str) - Entfernen Sie die nachgestellten trimStr-Zeichen aus str <br>        Argumente: <br>        str - ein Zeichenfolgenausdruck <br>        trimStr - die zu trimmenden Zeichenfolgenzeichen, der Standardwert ist ein einzelnes Leerzeichen <br>        BOTH, FROM - Dies sind Schlüsselwörter, um das Kürzen von Zeichenfolgenzeichen von beiden Enden der Zeichenfolge anzugeben. <br>        LEADING, FROM - Dies sind Schlüsselwörter, um das Trimmen von Zeichenfolgenzeichen am linken Ende der Zeichenfolge anzugeben <br>        TRAILING, FROM - Dies sind Schlüsselwörter, um das Trimmen von Zeichenfolgenzeichen am rechten Ende der Zeichenfolge anzugeben",
    "ucase": "Gibt str zurück, wobei alle Zeichen in Großbuchstaben geändert wurden.",
    "upper": "Gibt str zurück, wobei alle Zeichen in Großbuchstaben geändert wurden.",
    "variance": "Gibt die Stichprobenvarianz zurück, die aus Werten einer Gruppe berechnet wurde.",
    "weekday": "Gibt den Wochentag für Datum/Zeitstempel zurück (0 = Montag, 1 = Dienstag, ..., 6 = Sonntag).",
    "weekofyear": "Gibt die Woche des Jahres des angegebenen Datums zurück. Eine Woche beginnt an einem Montag und Woche 1 ist die erste Woche mit >3 Tagen.",
    "year": "Gibt die Jahreskomponente des Datums-/Zeitstempels zurück."
  }
}
