










# errors during export SVG
# errors during import KPI
# errors for import / export
# generic errors
# labels for interface
# labels for tree
# missing reference to referred resource
#SBISet.importexport.expResources= Export resources (OLAP schemas, datamarts, ETL jobs)
100=\u00C1ltal\u00E1nos hiba
10000 = Hiba a(z) (%2) c\u00EDmk\u00E9vel rendelkez\u0151 (%1) szerinti (%0) lek\u00E9r\u00E9s\u00E9nek k\u00EDs\u00E9rlete k\u00F6zben
101=Nem lehet bet\u00F6lteni az adatokat
7000=Hiba egy SVG-dokumentum export\u00E1l\u00E1sa sor\u00E1n
7001=SVG-dokumentum export\u00E1l\u00E1si hiba: nem lehet lek\u00E9rni a haszn\u00E1lt hierarchi\u00E1val kapcsolatos inform\u00E1ci\u00F3kat a sablonb\u00F3l
7002=SVG-dokumentum export\u00E1l\u00E1si hiba: hiba t\u00F6rt\u00E9nt a sablonba t\u00F6rt\u00E9n\u0151 tagmeghat\u00E1roz\u00E1s feldolgoz\u00E1sa sor\u00E1n
7003=SVG-dokumentum export\u00E1l\u00E1si hiba: nem lehet lek\u00E9rni a haszn\u00E1lt adatk\u00E9szletekkel kapcsolatos inform\u00E1ci\u00F3kat a sablonb\u00F3l
8001=Nem lehet hozz\u00E1rendelni t\u00F6bb export\u00E1lt szerepet ugyanahhoz a rendszerszerephez
8002=Egy export\u00E1lt kapcsolat nincs hozz\u00E1rendelve a jelenlegi rendszerkapcsolathoz
8003=Hiba a kapcsolat-hozz\u00E1rendel\u00E9s lek\u00E9r\u00E9se sor\u00E1n
8004=\u00C1ltal\u00E1nos hiba az import\u00E1l\u00E1si f\u00E1zis k\u00F6zben
8005=\u00C1ltal\u00E1nos hiba az export\u00E1l\u00E1si f\u00E1zis k\u00F6zben
8006=Az export\u00E1l\u00E1si f\u00E1jln\u00E9v nincs megadva
8007=Az export\u00E1l\u00E1si f\u00E1jl nincs bet\u00F6ltve
8008=<br/>Nem lehet export\u00E1lni a(z) <b>\u201E%0\u201D</b> \u00E9rt\u00E9klist\u00E1t, mert egy olyan <b>\u201E%1\u201D</b> adatforr\u00E1shoz van hozz\u00E1rendelve, amely nincs meghat\u00E1rozva.<br/> Ellen\u0151rizze az adatforr\u00E1s be\u00E1ll\u00EDt\u00E1s\u00E1t, vagy v\u00E1ltoztassa meg az \u00E9rt\u00E9klista adatforr\u00E1s\u00E1t.
8009=A hozz\u00E1rendel\u00E9sek f\u00E1jl nem \u00E9rv\u00E9nyes
8010=Hiba egy KPI-dokumentum export\u00E1l\u00E1sa sor\u00E1n
8011= Nem tal\u00E1lhat\u00F3 az export.properties f\u00E1jl: gy\u0151z\u0151dj\u00F6n meg arr\u00F3l, hogy nem nevezte-e \u00E1t az export\u00E1l\u00E1si f\u00E1jlt
8012= Ne lehet munkamenetet megnyitni az export\u00E1lt adatb\u00E1zison: ellen\u0151rizze az export\u00E1lt parancsf\u00E1jlokat
8013= Hiba az export\u00E1lt szerepek lek\u00E9rdez\u00E9s\u00E9ben
8014 = Hiba az export\u00E1lt BI objektumok lek\u00E9rdez\u00E9s\u00E9ben a(z) %0 t\u00E1bl\u00E1b\u00F3l
8015 = Hiba az export\u00E1lt motorok lek\u00E9rdez\u00E9s\u00E9ben
8016 = Hiba az export\u00E1lt \u00E9r\u00E9klista kapcsolati hivatkoz\u00E1s\u00E1nak friss\u00EDt\u00E9se sor\u00E1n
8017 = Hiba az arch\u00EDvumtartalomnak egy \u00E1tmeneti f\u00E1jlba val\u00F3 \u00EDr\u00E1sa sor\u00E1n
8018 = Hiba a szerepek ellen\u0151rz\u00E9s\u00E9ben: k\u00E9t olyan szerep lett export\u00E1lva, amely ugyanazon rendszerszerepre hivatkoz\u00E1sk\u00E9nt lett kiv\u00E1lasztva
8019 = Hiba a(z) (%1) azonos\u00EDt\u00F3val rendelkez\u0151 (%0) import\u00E1l\u00E1sa sor\u00E1n
8020 = Hiba a(z) %1 haszn\u00E1lat\u00E1val val\u00F3 %0 import\u00E1l\u00E1sa sor\u00E1n: %2
8021= Hiba a(z) %0 c\u00EDmk\u00E9vel rendelkez\u0151 dokumentumra hivatkoz\u00F3 sablon import\u00E1l\u00E1sa k\u00F6zben: a sablon m\u00E9rete nem lehet nagyobb az adatb\u00E1zis be\u00E1ll\u00EDt\u00E1sain\u00E1l: tov\u00E1bbi inform\u00E1ci\u00F3k\u00E9rt n\u00E9zze meg a napl\u00F3t
8022 = Hiba a(z) (%0) adatforr\u00E1s import\u00E1l\u00E1sa sor\u00E1n: a jelenlegi felhaszn\u00E1l\u00F3 nem szuperrendszergazda, \u00E9s nem sz\u00FArhat\u00F3 be JNDI t\u00EDpus\u00FA adatforr\u00E1s, rendelje hozz\u00E1 egy megl\u00E9v\u0151h\u00F6z
8023 = Hiba a(z) (%0) adatforr\u00E1s import\u00E1l\u00E1sa sor\u00E1n: az adatforr\u00E1s nincs hozz\u00E1rendelve a jelenlegi %1 b\u00E9rl\u0151h\u00F6z, \u00E9s a felhaszn\u00E1l\u00F3 nem hozhat l\u00E9tre hozz\u00E1rendel\u00E9st
8024 = Hiba a(z) (%0) motor import\u00E1l\u00E1sa sor\u00E1n: a motor nincs hozz\u00E1rendelve a jelenlegi %1 b\u00E9rl\u0151h\u00F6z, \u00E9s a felhaszn\u00E1l\u00F3 nem szuperrendszergazda, \u00EDgy nem v\u00E9gezhet hozz\u00E1rendel\u00E9st
8025 = Hiba a(z) (%0) motor import\u00E1l\u00E1sa sor\u00E1n: a felhaszn\u00E1l\u00F3 nem szuperrendszergazda, \u00E9s nem sz\u00FArhat be \u00FAj motort
8026 = Hiba a(z) (%0) t\u00E1bla import\u00E1l\u00E1sa sor\u00E1n: t\u00F6bb adatk\u00E9szlet tal\u00E1lhat\u00F3 ugyanazzal a n\u00E9vvel (%1). Meg kell v\u00E1ltoztatni az egyik\u00FCk nev\u00E9t, majd \u00FAj export\u00E1l\u00E1st kell k\u00E9sz\u00EDteni.
9000 = Hiba: az import\u00E1l\u00E1si adatb\u00E1zisban egyn\u00E9l t\u00F6bb (%0) tal\u00E1lhat\u00F3 ugyanazzal a kulccsal
9001 = Hiba: az import\u00E1l\u00E1si adatb\u00E1zisban egyn\u00E9l t\u00F6bb k\u00FCsz\u00F6bszint tal\u00E1lhat\u00F3 ugyanazzal a k\u00F3ddal 
9002 = Hiba: az import\u00E1l\u00E1si adatb\u00E1zisban egyn\u00E9l t\u00F6bb KPI tal\u00E1lhat\u00F3 ugyanazzal a n\u00E9vvel 
9003 = Hiba: az import\u00E1l\u00E1si adatb\u00E1zisban egyn\u00E9l t\u00F6bb modell tal\u00E1lhat\u00F3 ugyanazzal a k\u00F3ddal 
9004 = Hiba: az import\u00E1l\u00E1si adatb\u00E1zisban egyn\u00E9l t\u00F6bb modellp\u00E9ld\u00E1ny tal\u00E1lhat\u00F3 ugyanazzal a c\u00EDmk\u00E9vel 
9005 = Hiba: az import\u00E1l\u00E1si adatb\u00E1zisban egyn\u00E9l t\u00F6bb er\u0151forr\u00E1s tal\u00E1lhat\u00F3 ugyanazzal a n\u00E9vvel 
9006 = Hiba: az import\u00E1l\u00E1si adatb\u00E1zisban egyn\u00E9l t\u00F6bb periodicit\u00E1s tal\u00E1lhat\u00F3 ugyanazzal a n\u00E9vvel 
9007 = Hiba: az import\u00E1l\u00E1si adatb\u00E1zisban egyn\u00E9l t\u00F6bb riaszt\u00E1s tal\u00E1lhat\u00F3 ugyanazzal a c\u00EDmk\u00E9vel 
9008 = Hiba: az import\u00E1l\u00E1si adatb\u00E1zisban egyn\u00E9l t\u00F6bb riaszt\u00E1spartner tal\u00E1lhat\u00F3 ugyanazzal a n\u00E9vvel 
9009 = Hiba: az import\u00E1l\u00E1si adatb\u00E1zisban egyn\u00E9l t\u00F6bb k\u00FCsz\u00F6bszint\u00E9rt\u00E9k tal\u00E1lhat\u00F3 ugyanazzal a n\u00E9vvel \u00E9s ugyanarra a k\u00FCsz\u00F6bszintre hivatkozva 
9010 = Hiba: az import\u00E1l\u00E1si adatb\u00E1zisban egyn\u00E9l t\u00F6bb KPI-kapcsolat tal\u00E1lhat\u00F3 ugyanazzal a KPI-gyermekkel, sz\u00FCl\u0151vel \u00E9s param\u00E9terrel
impexp.Associations = Hozz\u00E1rendel\u00E9sek
impexp.creationDate = L\u00E9trehoz\u00E1s d\u00E1tuma
impexp.defaultAss = F\u00E1jlhozz\u00E1rendel\u00E9sek
impexp.description = Le\u00EDr\u00E1s 
impexp.erase = T\u00F6rl\u00E9s
impexp.file = F\u00E1jl
impexp.listAssFile = Hozz\u00E1rendel\u00E9si f\u00E1jlok felsorol\u00E1sa
impexp.manageAss = Hozz\u00E1rendel\u00E9sek kezel\u00E9se
impexp.mandatoryAss = K\u00F6telez\u0151 hozz\u00E1rendel\u00E9sek 
impexp.manualtask.birtDocsUpdate = Birt-dokumentumok: friss\u00EDt\u00E9s
impexp.manualtask.datamarts = Datamart-dokumentumok: k\u00F6zz\u00E9t\u00E9tel \u00E9s be\u00E1ll\u00EDt\u00E1s
impexp.manualtask.exists = Figyelem! Az import\u00E1l\u00E1si elj\u00E1r\u00E1s egyes feladatai nem hajthat\u00F3k v\u00E9gre automatikusan. A k\u00F6vetkez\u0151 feladatokat mind el kell v\u00E9gezni az import\u00E1l\u00E1s befejez\u00E9s\u00E9hez. Kattintson r\u00E1 mindegyikre, mentse el a let\u00F6lt\u00F6tt f\u00E1jlt, \u00E9s k\u00F6vesse a benne tal\u00E1lhat\u00F3 utas\u00EDt\u00E1sokat (n\u00E9zze meg a Readme.txt f\u00E1jlt).
impexp.name = N\u00E9v
impexp.overwrite = Fel\u00FCl\u00EDrja a megl\u00E9v\u0151 metaadatokat az export\u00E1lttal?
impexp.overwrite.no = Nem
impexp.overwrite.yes = Igen 
impexp.save = Ment\u00E9s
impexp.saveAss = Hozz\u00E1rendel\u00E9sek f\u00E1jl ment\u00E9se
impexp.savedAss = Mentett hozz\u00E1rendel\u00E9sek
impexp.select = Kiv\u00E1laszt\u00E1s
impexp.selectFromList = Kiv\u00E1laszt\u00E1s list\u00E1b\u00F3l
impexp.withoutAss = Nincsenek hozz\u00E1rendel\u00E9sek
Sbi.associated = A haszn\u00E1latban l\u00E9v\u0151 hozz\u00E1rendel\u00E9si f\u00E1jl \u00E1ltal v\u00E9gzett hozz\u00E1rendel\u00E9s
Sbi.back = Vissza
Sbi.checks = Ellen\u0151rz\u00E9sek
Sbi.download = Let\u00F6lt\u00E9s
Sbi.downloadAss = Hozz\u00E1rendel\u00E9sek f\u00E1jl let\u00F6lt\u00E9se
Sbi.downloadLog = Napl\u00F3f\u00E1jl let\u00F6lt\u00E9se
Sbi.engines = Motorok
Sbi.exit = Kil\u00E9p\u00E9s
Sbi.functionalities = Funkcionalit\u00E1sok
Sbi.lovs = \u00C9rt\u00E9kek list\u00E1ja
Sbi.next = K\u00F6vetkez\u0151
Sbi.objects = Objektumok
Sbi.parameters = Param\u00E9terek
Sbi.paruses = Param\u00E9terhaszn\u00E1latok
Sbi.saved.ko = Hiba a hozz\u00E1rendel\u00E9sek f\u00E1jl ment\u00E9se k\u00F6zben
Sbi.saved.ok = A hozz\u00E1rendel\u00E9sek f\u00E1jl megfelel\u0151en elmentve
Sbi.saving.alreadyExisting = M\u00E1r l\u00E9tezik egy ilyen nev\u0171 hozz\u00E1rendel\u00E9sek f\u00E1jl, fel\u00FCl\u00EDrja?
Sbi.saving.associationFileNotSpecified = A hozz\u00E1rendel\u00E9si f\u00E1jl nincs megadva
Sbi.saving.associationFileNotValid = A hozz\u00E1rendel\u00E9si f\u00E1jl nem \u00E9rv\u00E9nyes
Sbi.saving.insertNew = Sz\u00FArjon be egy \u00FAjat
Sbi.saving.nameNotSpecified = A n\u00E9v nincs megadva!
Sbi.selectcombo = Kiv\u00E1laszt\u00E1s\u2026
SBISet.datasourceAssociation = Adatforr\u00E1s hozz\u00E1rendel\u00E9sek
SBISet.engineAssociation = Motor hozz\u00E1rendel\u00E9sek
SBISet.export = Export\u00E1l\u00E1s
SBISet.impexp.currentChecks = A haszn\u00E1latban l\u00E9v\u0151 port\u00E1lba meghat\u00E1rozott ellen\u0151rz\u00E9sek
SBISet.impexp.currentDS = A haszn\u00E1latban l\u00E9v\u0151 port\u00E1lba meghat\u00E1rozott adatforr\u00E1sok
SBISet.impexp.currentEngines = A haszn\u00E1latban l\u00E9v\u0151 port\u00E1lba meghat\u00E1rozott motorok
SBISet.impexp.currentFunctionalities = A haszn\u00E1latban l\u00E9v\u0151 port\u00E1lba meghat\u00E1rozott funkcionalit\u00E1sok
SBISet.impexp.currentLovs = A haszn\u00E1latban l\u00E9v\u0151 port\u00E1lba meghat\u00E1rozott \u00E9rt\u00E9klist\u00E1k
SBISet.impexp.currentObjects = A haszn\u00E1latban l\u00E9v\u0151 port\u00E1lba meghat\u00E1rozott objektumok
SBISet.impexp.currentParameters = A haszn\u00E1latban l\u00E9v\u0151 port\u00E1lba meghat\u00E1rozott param\u00E9terek
SBISet.impexp.currentParuses = A haszn\u00E1latban l\u00E9v\u0151 port\u00E1lba meghat\u00E1rozott param\u00E9terhaszn\u00E1latok
SBISet.impexp.currentRoles = A haszn\u00E1latban l\u00E9v\u0151 port\u00E1l szerepei
SBISet.impexp.datasourceRule1 = A nem hozz\u00E1rendelt export\u00E1lt adatforr\u00E1sok mindenk\u00E9ppen import\u00E1lva lesznek
SBISet.impexp.enginerule1 = A nem hozz\u00E1rendelt export\u00E1lt motorok mindenk\u00E9ppen import\u00E1lva lesznek
SBISet.impexp.exportedChecks = Export\u00E1lt ellen\u0151rz\u00E9sek
SBISet.impexp.exportedDS = Export\u00E1lt adatforr\u00E1sok
SBISet.impexp.exportedEngines = Export\u00E1lt motorok
SBISet.impexp.exportedFunctionalities = Export\u00E1lt funkcionalit\u00E1sok
SBISet.impexp.exportedKpis = Export\u00E1lt KPI-k
SBISet.impexp.exportedLovs = Export\u00E1lt \u00E9rt\u00E9klist\u00E1k
SBISet.impexp.exportedObjects = Export\u00E1lt objektumok
SBISet.impexp.exportedParameters = Export\u00E1lt param\u00E9terek
SBISet.impexp.exportedParuses = Export\u00E1lt param\u00E9terhaszn\u00E1latok
SBISet.impexp.exportedRoles = Export\u00E1lt szerepek
SBISet.impexp.metadatarule1 = A rendszer \u00FAgy tal\u00E1lta, hogy n\u00E9h\u00E1ny export\u00E1lt metaadat \u00FCtk\u00F6zik
SBISet.impexp.metadatarule2 = Az export\u00E1lt metaadatok fel\u00FCl\u00EDrhatj\u00E1k a megl\u00E9v\u0151 port\u00E1l ugyanolyan egyedi azonos\u00EDt\u00F3val rendelkez\u0151 metaadatait, ha a fel\u00FCl\u00EDr\u00E1si lehet\u0151s\u00E9g enged\u00E9lyezve van
SBISet.impexp.metadatarule3 = Le\u00E1ll\u00EDthatja az import\u00E1l\u00E1si elj\u00E1r\u00E1st \u00E9s megv\u00E1ltoztathatja azoknak a metaadatoknak az azonos\u00EDt\u00F3it, amelyek az \u00FCtk\u00F6z\u00E9st okozz\u00E1k
SBISet.impexp.metadatarule4 = Ha folytatja \u00E9s a fel\u00FCl\u00EDr\u00E1si lehet\u0151s\u00E9g le van tiltva, akkor a rendszer nem fogja besz\u00FArni azokat az export\u00E1lt metaadatokat, amelyek \u00FCtk\u00F6z\u00E9seket okoznak
SBISet.impexp.noDSExported = Egyetlen adatforr\u00E1s sem lett export\u00E1lva
SBISet.impexp.noEngineExported = Egyetlen motor sem lett export\u00E1lva
SBISet.impexp.noRoleExported = Egyetlen szerep sem lett export\u00E1lva
SBISet.impexp.rolerule1 = Az export\u00E1lt szerepek \u00E9s az ugyanolyan nev\u0171 jelenlegi szerepek automatikusan hozz\u00E1rendel\u00E9sre ker\u00FClnek
SBISet.impexp.rolerule2 = A nem hozz\u00E1rendelt export\u00E1lt szerepek mindenk\u00E9ppen import\u00E1lva lesznek
SBISet.impexp.rolerule3 = Kett\u0151 vagy t\u00F6bb export\u00E1lt szerepet nem lehet hozz\u00E1rendelni egy jelenlegi port\u00E1lszerephez
SBISet.import = Import\u00E1l\u00E1s
SBISet.importexport = Import\u00E1l\u00E1s \u00E9s export\u00E1l\u00E1s
SBISet.importexport.deselectall = \u00D6sszes kijel\u00F6l\u00E9s\u00E9nek megsz\u00FCntet\u00E9se
SBISet.importexport.expBirtTranslation =  BIRT ford\u00EDt\u00E1sok export\u00E1l\u00E1sa
SBISet.importexport.expCrossNav = Keresztnavig\u00E1ci\u00F3 export\u00E1l\u00E1sa
SBISet.importexport.exportCompleteResourcesWarning = Ne feledje, hogy az er\u0151forr\u00E1sok (ETL-feladatok t\u00E1rol\u00F3ja, k\u00E9pek stb.) nem lettek export\u00E1lva: \u00E1t kell m\u00E1solnia azokat ennek a forr\u00E1srendszernek az er\u0151forr\u00E1sok mapp\u00E1j\u00E1b\u00F3l a c\u00E9lk\u00F6rnyezeten l\u00E9v\u0151 megfelel\u0151 mapp\u00E1ba.
SBISet.importexport.exportRelatedDocs = Kapcsol\u00F3d\u00F3 dokumentumok export\u00E1l\u00E1sa
SBISet.importexport.expScheduler = \u00DCtemez\u00E9si be\u00E1ll\u00EDt\u00E1sok export\u00E1l\u00E1sa
SBISet.importexport.expSelFun = Csak a kijel\u00F6lt funkcionalit\u00E1sban l\u00E9v\u0151 dokumentum export\u00E1l\u00E1sa
SBISet.importexport.expSnapshots = \u00DCtemezett dokumentumok export\u00E1l\u00E1sa
SBISet.importexport.expSubView = Olap szem\u00E9lyre szabott n\u00E9zet\u00E9nek export\u00E1l\u00E1sa
SBISet.importexport.fileArchive = Export\u00E1l\u00E1si f\u00E1jl
SBISet.importexport.fileAssociation = Hozz\u00E1rendel\u00E9sek f\u00E1jl
SBISet.importexport.nameExp = Export\u00E1l\u00E1si f\u00E1jln\u00E9v
SBISet.importexport.opComplete = A m\u0171velet befejezve
SBISet.importexport.opProg = A m\u0171velet folyamatban, k\u00E9rem v\u00E1rjon\u2026
SBISet.importexport.selectall = \u00D6sszes kijel\u00F6l\u00E9se
SBISet.importexport.document = Dokumentum
SBISet.importexport.menu = Men\u00FC
SBISet.metadataConflicts = Metaadat-\u00FCtk\u00F6z\u00E9sek
SBISet.roleAssociation = Szerep hozz\u00E1rendel\u00E9sek
tree.objectstree.name = Objektumok f\u00E1ja
tree.rootfolder.description = Funkcionalit\u00E1sok (ter\u00FCletek)
tree.rootfolder.name = Funkcionalit\u00E1sok (ter\u00FCletek)
