{
  "dataPreparation": {
    "abs": "A numerikus érték abszolút értékét adja eredményül.",
    "acos": "Az expr inverz koszinuszát (más néven ív koszinuszát) adja eredményül, mintha a java.lang.Math.acos számította volna ki.",
    "add_months": "A start_date után num_months dátumot adja eredményül.",
    "approx_percentile": "A numerikus oszlopcsomó hozzávetőleges percentilisét adja eredményül, amely a legkisebb érték a rendezett col értékekben (a legkisebbtől a legnagyobbig rendezve), így a kolértékek legfeljebb százaléka kisebb, mint az érték vagy egyenlő ezzel az értékkel. A százalék értékének 0,0 és 1,0 között kell lennie. A pontossági paraméter (alapértelmezett: 10000) egy pozitív numerikus szóhasználat, amely szabályozza a közelítés pontosságát a memória rovására. A nagyobb pontossági érték jobb pontosságot eredményez, az 1,0/pontosság a közelítés relatív hibája. Ha a százalék tömb, akkor a százaléktömb minden értékének 0,0 és 1,0 között kell lennie. Ebben az esetben az oszlopkombíció hozzávetőleges percentilis tömbjét adja eredményül az adott százaléktömbben.",
    "asin": "Az inverz szinusz (más néven ív szinusz) az expr ívbűnét adja eredményül, mintha a java.lang.Math.asin számítaná ki.",
    "atan": "Az expr inverz érintőjét (más néven ív érintőjét) adja eredményül, mintha a java.lang.Math.atan számítaná ki.",
    "avg": "Egy csoport értékeiből kiszámított átlagot számítja ki.",
    "casewhen": "Ha expr1 = true, expr2 értéket ad vissza; más, ha expr3 = igaz, az expr4 értéket adja eredményül; else returns expr5. Érvek: <br> expr1, expr3 - az ág feltételkifejezéseinek mind logikai típusúnak kell lenniük. <br> expr2, expr4, expr5 - az elágazó értékkifejezéseknek és az else értékkifejezésnek azonos típusúnak vagy kényszeríthetőnek kell lennie egy közös típussal szemben.",
    "char_length": "A karakterláncadatok karakterhosszát vagy a bináris adatok bájtjainak számát adja eredményül. A karakterláncadatok hossza tartalmazza a záró szóközöket. A bináris adatok hossza bináris nullákat tartalmaz.",
    "coalesce": "Ha létezik, az első nem null argumentumot adja eredményül. Ellenkező esetben null.",
    "concat": "A col1, col2, ..., colN összefűzését adja eredményül.",
    "cos": "Az expr koszinuszát adja eredményül, mintha a java.lang.Math.cos számítaná ki.",
    "current_date": "A lekérdezés kiértékelésének kezdetén aktuális dátumot adja eredményül.",
    "current_timestamp": "A lekérdezés kiértékelésének kezdetén aktuális időbélyeget ad eredményül.",
    "date_add": "A start_date után num_days dátumot adja eredményül.",
    "date_sub": "A start_date előtti num_days dátumot adja eredményül.",
    "date_trunc": "Az fmt formátummodell által megadott egységhez csonkolt időbélyeget ad eredményül. fmt kell az egyik [\"ÉV\", \"YYYY\", \"YY\", \"MON\", \"HÓNAP\", \"MM\", \"NAP\", \"DD\", \"ÓRA\", \"PERC\", \"MÁSODIK\", \"HÉT\", \"NEGYED\"]",
    "datediff": "A startDátumtól az endDátumig terjedő napok számát adja eredményül.",
    "day": "A dátum/időbélyeg hónapjának napját adja eredményül.",
    "dayofmonth": "A dátum/időbélyeg hónapjának napját adja eredményül.",
    "dayofweek": "A hét napját adja eredményül dátum/időbélyegző (1 = vasárnap, 2 = hétfő, ..., 7 = szombat).",
    "dayofyear": "A dátum/időbélyeg évének napját adja eredményül.",
    "dense_rank": "Egy értékcsoportban lévő érték rangjának kiszámítása. Az eredmény egy plusz a korábban hozzárendelt rangérték. A függvény rangjával ellentétben dense_rank nem eredményez hézagokat a rangsorolási sorrendben.",
    "element_at": "A tömb elemét adja eredményül adott (1 alapú) indexen. Ha az index < 0, accesses elements from the last to the first. Returns NULL if the index exceeds the length of the array.",
    "element_at2": "Adott kulcs értékét adja eredményül, vagy NULL értéket, ha a kulcs nem szerepel a térképen.",
    "exists": "Azt vizsgálja, hogy egy predikátum tartalmaz-e egy vagy több elemet a tömbben.",
    "exp": "Visszaadja e-nek az expr erejét.",
    "factorial": "Az expr faktoriális értékét adja eredményül. expr az [0..20]. Ellenkező esetben null.",
    "floor": "Az expr-nél nem nagyobb legnagyobb egész számot adja eredményül.",
    "format_string": "Printf stílusú formátumú karakterláncokból formázott karakterláncot ad eredményül.",
    "hint": "Kattintson az egyik felsorolt funkcióra, hogy további információkat kapjon róla",
    "hour": "A karakterlánc/időbélyeg óra összetevőjét adja eredményül.",
    "if": "Ha az expr1 értéke igaz, akkor expr2 értéket ad vissza; ellenkező esetben expr3 értéket ad vissza.",
    "last_day": "Annak a hónapnak az utolsó napját adja eredményül, amelyhez a dátum tartozik.",
    "lcase": "Az str értéket adja eredményül, ha az összes karakter kisbetűsre változik.",
    "left": "A sztring str bal szélső len (len lehet karakterlánctípus) karaktereit adja eredményül, ha az len kisebb vagy egyenlő 0-nál, az eredmény üres karakterlánc.",
    "length": "A karakterláncadatok karakterhosszát vagy a bináris adatok bájtjainak számát adja eredményül. A karakterláncadatok hossza tartalmazza a záró szóközöket. A bináris adatok hossza bináris nullákat tartalmaz.",
    "ln": "Az expr természetes logaritmusát (e bázis) számítja ki.",
    "locate": "Az alstr első előfordulásának helyzetét adja eredményül a pozíció után. Az adott pos és return érték 1-alapú.",
    "log": "Az expr logaritmusát adja eredményül alapnal.",
    "lower": "Az str értéket adja eredményül, ha az összes karakter kisbetűsre változik.",
    "lpad": "Visszaadja az str-et, bal oldali párnával párnázva, len hosszúságúra. Ha az str hosszabb, mint a len, a visszatérési érték len karakterekre rövidül.",
    "ltrim1": "Eltávolítja a kezdő szóköz karaktereket az str.",
    "ltrim2": "Eltávolítja a vágási karakterláncból származó karaktereket tartalmazó kezdő karakterláncot",
    "max": "Az expr maximális értékét adja eredményül.",
    "mean": "Egy csoport értékeiből kiszámított átlagot számítja ki.",
    "min": "Az expr minimális értékét adja eredményül.",
    "minute": "A karakterlánc/időbélyeg percösszetevőjét adja eredményül.",
    "mod": "A maradékot az expr1/expr2 után adja eredményül.",
    "month": "A dátum/időbélyeg hónap összetevőjét adja eredményül.",
    "months_between": "Ha az időbélyeg1 későbbi, mint az időbélyeg2, akkor az eredmény pozitív. Ha az időbélyeg1 és az időbélyeg2 ugyanazon a hónap napján van, vagy mindkettő a hónap utolsó napja, a program figyelmen kívül hagyja a napszakot. Ellenkező esetben a különbséget a program havonta 31 nap alapján számítja ki, és 8 számjegyre kerekíti, kivéve, ha roundOff=false.",
    "next_day": "Az első dátumot adja eredményül, amely későbbi, mint start_date, és a megadott módon elnevezett.",
    "not": "Logikus, hogy nem.",
    "nullif": "Null értéket ad eredményül, ha az expr1 értéke expr2, vagy expr1 más.",
    "nvl": "Expr2 értéket ad eredményül, ha az expr1 null, vagy az expr1 más módon.",
    "percent_rank": "Egy érték százalékos rangsorolását számítja ki egy értékcsoportban.",
    "percentile1": "A numerikus oszlop col pontos percentilisértékét adja eredményül az adott százalékban. A százalék értékének 0,0 és 1,0 között kell lennie. A gyakoriság értékének pozitív integráltnak kell lennie",
    "percentile2": "A numerikus oszlopcsíkok pontos percentilisérték-tömbjét adja eredményül az adott százalék(ok)on. A százaléktömb minden értékének 0,0 és 1,0 között kell lennie. A gyakoriság értékének pozitív integráltnak kell lennie",
    "pow": "Az expr1-et az expr2 erejére emeli.",
    "quarter": "A dátum évnegyedét adja eredményül, az 1 és 4 közötti tartományban.",
    "replace": "A keresés összes előfordulását lecseréli.",
    "round": "D tizedesjegyre kerekített expr értéket ad eredményül HALF_UP kerekítési móddal.",
    "rtrim1": "Eltávolítja a záró szóköz karaktereket az str.",
    "rtrim2": "Eltávolítja a záró karakterláncot, amely tartalmazza a karaktereket a trim karakterláncból az str",
    "second": "A karakterlánc/időbélyeg második összetevőjét adja eredményül.",
    "sha": "Sha1 kivonatértéket ad eredménymutató hatszögletes karakterláncaként.",
    "sin": "Az expr szinuszát adja eredményül, mintha a java.lang.Math.sin számítaná ki.",
    "skewness": "A csoport értékeiből kiszámított ferdeségi értéket adja eredményül.",
    "stddev": "A csoport értékeiből kiszámított szórásmintát számítja ki.",
    "stddev_pop": "A csoport értékeiből kiszámított populációs szórást adja eredményül.",
    "stddev_samp": "A csoport értékeiből kiszámított szórásmintát számítja ki.",
    "substr": "Az str alkarakterláncát adja eredményül, amely pos-nál kezdődik és len hosszúságú, vagy a bájttömb szeletét, amely pos-nál kezdődik és len hosszúságú.",
    "tan": "Az expr érintőjét adja eredményül, mintha a java.lang.Math.tan alapján számítaná ki.",
    "timestamp": "Az expr értéket a cél adattípus időbélyegére veti.",
    "to_date": "A date_str kifejezést az fmt kifejezéssel egy dátumra elemzi. Érvénytelen bemenettel null értéket ad vissza. Alapértelmezés szerint az öntési szabályokat egy dátumig követi, ha az fmt nincs megadva.",
    "to_timestamp": "Időbélyegzővé elemzi a timestamp_str kifejezést az fmt kifejezéssel. Érvénytelen bemenettel null értéket ad vissza. Alapértelmezés szerint az öntési szabályokat időbélyegzőre követi, ha az fmt nincs megadva.",
    "trim": "trim(str) - Eltávolítja a kezdő és záró szóköz karaktereket az str. <br>        trim(BOTH trimStr FROM str) - Távolítsa el a vezető és a záró trimStr karaktereket az str <br>        trim(LEADING trimStr FROM str) - Távolítsa el a kezdő trimStr karaktereket a str <br>        trim(TRAILING trimStr FROM str) - Távolítsa el a záró trimStr karaktereket a str <br>        Érvek: <br>        str - karakterlánc-kifejezés <br>        trimStr - a vágási karakterlánc karaktereit kell vágni, az alapértelmezett érték egyetlen szóköz <br>        MINDKETTŐ, FROM - ezek olyan kulcsszavak, amelyek a karakterlánc mindkét végéből származó karakterlánc-karakterek vágását írják meg <br>        LEADING, FROM - ezek a kulcsszavak a karakterlánc bal végéből származó karakterlánc-karakterek vágásához <br>        TRAILING, FROM - ezek a kulcsszavak a karakterlánc jobb végéből származó vágási karakterlánckarakterek megadására",
    "ucase": "Az str értéket adja eredményül, ha az összes karakter nagybetűre változik.",
    "upper": "Az str értéket adja eredményül, ha az összes karakter nagybetűre változik.",
    "variance": "A csoport értékeiből kiszámított mintaeltérést adja eredményül.",
    "weekday": "A hét napját adja eredményül dátum/időbélyegző (0 = hétfő, 1 = kedd, ..., 6 = vasárnap).",
    "weekofyear": "Az adott dátum évének hetét adja eredményül. Egy hét hétfőn kezdődik, az 1. hét pedig az első hét, >3 nappal.",
    "year": "A dátum/időbélyeg év összetevőjét adja eredményül."
  }
}
