{
  "dataPreparation": {
    "abs": "ترجع هذه الدالة القيمة المطلقة للقيمة الرقمية.",
    "acos": "ترجع هذه الدالة جيب التمام العكسي (المعروف أيضا باسم جيب التمام القوقي) الخاص ب expr، كما لو كان محسوبا بواسطة java.lang.Math.acos.",
    "add_months": "ترجع هذه الدالة التاريخ الذي num_months بعد start_date.",
    "approx_percentile": "ترجع هذه الدالة النسبة المئوية التقريبية للعمود الرقمي col وهي أصغر قيمة في قيم col المرتبة (مرتبة من الأقل إلى الأكبر) بحيث لا تزيد النسبة المئوية لقيم col عن القيمة أو تساوي تلك القيمة. يجب أن تكون قيمة النسبة المئوية بين 0.0 و 1.0. معلمة الدقة (الافتراضية: 10000) هي حرفية رقمية موجبة تتحكم في دقة التقريب على حساب الذاكرة. القيمة الأعلى للدقة تعطي دقة أفضل ، 1.0 / الدقة هي الخطأ النسبي للتقريب. عندما تكون النسبة المئوية عبارة عن صفيف، يجب أن تكون كل قيمة من قيم صفيف النسبة المئوية بين 0.0 و1.0. في هذه الحالة، ترجع هذه الدالة صفيف النسبة المئوية التقريبي للعمود col في صفيف النسبة المئوية المحدد.",
    "asin": "ترجع هذه الدالة جيب الزاوية العكسي (المعروف أيضا باسم جيب جيب القوس) خطيئة قوس إكسبر، كما لو كانت محسوبة بواسطة java.lang.Math.asin.",
    "atan": "إرجاع المماس العكسي (المعروف أيضا باسم ظل القوس) ل expr، كما لو كان محسوبا بواسطة java.lang.Math.atan",
    "avg": "ترجع هذه الدالة الوسط الحسابي المحسوب من قيم مجموعة.",
    "casewhen": "عندما expr1 = true، ترجع expr2; آخر عندما expr3 = true، إرجاع expr4; آخر إرجاع expr5. الحجج: <br> expr1 ، expr3 - يجب أن تكون جميع تعبيرات شرط الفرع من النوع المنطقي. <br> expr2 و expr4 و expr5 - يجب أن تكون تعبيرات قيمة الفرع وتعبير القيمة الأخرى من نفس النوع أو قابلة للإكراه على نوع شائع.",
    "char_length": "ترجع هذه الدالة طول حرف بيانات السلسلة أو عدد وحدات بايت البيانات الثنائية. يتضمن طول بيانات السلسلة المسافات اللاحقة. يتضمن طول البيانات الثنائية أصفارا ثنائية.",
    "coalesce": "ترجع هذه الدالة الوسيطة الأولى غير الخالية إن وجدت. خلاف ذلك ، فارغة.",
    "concat": "إرجاع سلسلة من col1, col2, ..., colN.",
    "cos": "ترجع هذه الدالة جيب التمام الخاص ب expr، كما لو كان محسوبا بواسطة java.lang.Math.cos.",
    "current_date": "إرجاع التاريخ الحالي في بداية تقييم الاستعلام.",
    "current_timestamp": "إرجاع الطابع الزمني الحالي في بداية تقييم الاستعلام.",
    "date_add": "إرجاع التاريخ الذي num_days بعد start_date.",
    "date_sub": "ترجع هذه الدالة التاريخ الذي num_days قبل start_date.",
    "date_trunc": "إرجاع الطابع الزمني ts المقطوع إلى الوحدة المحددة بواسطة نموذج التنسيق fmt. يجب أن تكون FMT واحدة من [\"السنة\" ، \"YYYYY\" ، \"YY\" ، \"الاثنين\" ، \"الشهر\" ، \"مم\" ، \"اليوم\" ، \"DD\" ، \"الساعة\" ، \"الدقيقة\" ، \"الثانية\" ، \"الأسبوع\" ، \"الربع\"]",
    "datediff": "ترجع هذه الدالة عدد الأيام من تاريخ البدء إلى تاريخ الانتهاء.",
    "day": "إرجاع يوم الشهر من التاريخ/الطابع الزمني.",
    "dayofmonth": "إرجاع يوم الشهر من التاريخ/الطابع الزمني.",
    "dayofweek": "إرجاع يوم الأسبوع للتاريخ/الطابع الزمني (1 = الأحد، 2 = الاثنين، ...، 7 = السبت).",
    "dayofyear": "إرجاع يوم السنة من التاريخ/الطابع الزمني.",
    "dense_rank": "يحسب رتبة قيمة في مجموعة من القيم. والنتيجة هي واحد بالإضافة إلى قيمة الرتبة المعينة مسبقا. على عكس رتبة الدالة ، لن ينتج dense_rank فجوات في تسلسل الترتيب.",
    "element_at": "إرجاع عنصر الصفيف في فهرس معين (يستند إلى 1). إذا كان الفهرس < 0, accesses elements from the last to the first. Returns NULL if the index exceeds the length of the array.",
    "element_at2": "إرجاع قيمة مفتاح معين، أو NULL إذا لم يكن المفتاح موجودا في الخريطة",
    "exists": "يختبر ما إذا كان المسند يحتفظ بعنصر واحد أو أكثر في الصفيف.",
    "exp": "إرجاع e إلى قوة expr.",
    "factorial": "ترجع هذه الدالة معامل expr. expr هو [0..20]. خلاف ذلك ، فارغة.",
    "floor": "إرجاع أكبر عدد صحيح لا يزيد عن expr.",
    "format_string": "ترجع هذه الدالة سلسلة منسقة من سلاسل تنسيق نمط printf.",
    "hint": "انقر فوق إحدى الوظائف المدرجة للحصول على مزيد من المعلومات حولها",
    "hour": "ترجع هذه الدالة مكون الساعة من السلسلة/الطابع الزمني.",
    "if": "إذا تم تقييم expr1 إلى true ، فقم بإرجاع expr2 ؛ خلاف ذلك يعود expr3.",
    "last_day": "إرجاع اليوم الأخير من الشهر الذي ينتمي إليه التاريخ.",
    "lcase": "إرجاع str مع تغيير جميع الأحرف إلى أحرف صغيرة.",
    "left": "إرجاع أحرف len (يمكن أن يكون len من نوع السلسلة) في أقصى اليسار من str السلسلة، إذا كان len أقل أو يساوي 0 فإن النتيجة هي سلسلة فارغة.",
    "length": "ترجع هذه الدالة طول حرف بيانات السلسلة أو عدد وحدات بايت البيانات الثنائية. يتضمن طول بيانات السلسلة المسافات اللاحقة. يتضمن طول البيانات الثنائية أصفارا ثنائية.",
    "ln": "إرجاع اللوغاريتم الطبيعي (الأساس e) الخاص ب expr.",
    "locate": "ترجع هذه الدالة موضع أول ظهور للركيزة في str بعد موضع الوضع. نقاط البيع المعطاة وقيمة الإرجاع تستند إلى 1.",
    "log": "ترجع هذه الدالة لوغاريتم expr مع الأساس.",
    "lower": "إرجاع str مع تغيير جميع الأحرف إلى أحرف صغيرة.",
    "lpad": "إرجاع str، مبطن إلى اليسار مع وسادة إلى طول len. إذا كان str أطول من len، تقصير قيمة الإرجاع إلى أحرف len.",
    "ltrim1": "يزيل أحرف المسافة البادئة من str.",
    "ltrim2": "إزالة السلسلة البادئة التي تحتوي على الأحرف من سلسلة القطع",
    "max": "إرجاع الحد الأقصى لقيمة expr",
    "mean": "ترجع هذه الدالة الوسط الحسابي المحسوب من قيم مجموعة.",
    "min": "إرجاع الحد الأدنى لقيمة expr",
    "minute": "إرجاع مكون الدقيقة من السلسلة/الطابع الزمني.",
    "mod": "ترجع هذه الدالة الباقي بعد expr1/expr2.",
    "month": "إرجاع مكون الشهر من طابع التاريخ/الوقت.",
    "months_between": "إذا كان الطابع الزمني1 متأخرا عن الطابع الزمني2، فستكون النتيجة إيجابية. إذا كان الطابع الزمني1 والطابع الزمني2 في نفس اليوم من الشهر، أو كلاهما آخر يوم من الشهر، تجاهل الوقت من اليوم. خلاف ذلك ، يتم حساب الفرق بناء على 31 يوما في الشهر ، ويتم تقريبه إلى 8 أرقام ما لم يتم roundOff = false.",
    "next_day": "ترجع هذه الدالة التاريخ الأول الذي يتأخر عن start_date والمسمى كما هو موضح.",
    "not": "منطقي لا.",
    "nullif": "ترجع هذه الدالة فارغ إذا كان expr1 يساوي expr2 أو expr1 خلاف ذلك.",
    "nvl": "إرجاع expr2 إذا كان expr1 فارغا، أو expr1 بخلاف ذلك.",
    "percent_rank": "يحسب النسبة المئوية لترتيب قيمة في مجموعة من القيم.",
    "percentile1": "ترجع هذه الدالة القيمة المئوية الدقيقة للعمود الرقمي col عند النسبة المئوية المحددة. يجب أن تكون قيمة النسبة المئوية بين 0.0 و 1.0. يجب أن تكون قيمة التردد إيجابية متكاملة",
    "percentile2": "ترجع هذه الدالة صفيف القيمة المئوية الدقيق للعمود الرقمي col عند النسب المئوية (النسب المئوية) المحددة. يجب أن تكون كل قيمة من صفيف النسبة المئوية بين 0.0 و 1.0. يجب أن تكون قيمة التردد إيجابية متكاملة",
    "pow": "يرفع expr1 إلى قوة expr2.",
    "quarter1": "ترجع هذه الدالة ربع السنة للتاريخ، في النطاق من 1 إلى 4.",
    "quarter2": "ترجع هذه الدالة ربع السنة للتاريخ، في النطاق من 1 إلى 4.",
    "replace": "يستبدل جميع تكرارات البحث باستبدال.",
    "round": "إرجاع expr مقرب إلى المنازل العشرية d باستخدام وضع التقريب HALF_UP.",
    "rtrim1": "يزيل أحرف المسافة الزائدة من str.",
    "rtrim2": "يزيل السلسلة الزائدة التي تحتوي على الأحرف من سلسلة القطع من str",
    "second": "ترجع هذه الدالة المكون الثاني من السلسلة/الطابع الزمني.",
    "sha": "ترجع هذه الدالة قيمة تجزئة sha1 كسلسلة سداسية من expr.",
    "sin": "ترجع هذه الدالة جيب الزاوية للإكسبر، كما لو كانت محسوبة بواسطة java.lang.Math.sin.",
    "skewness": "ترجع هذه الدالة قيمة الانحراف المحسوبة من قيم مجموعة.",
    "stddev": "ترجع هذه الدالة نموذج الانحراف المعياري المحسوب من قيم مجموعة.",
    "stddev_pop": "ترجع هذه الدالة الانحراف المعياري للسكان المحسوب عن قيم مجموعة.",
    "stddev_samp": "ترجع هذه الدالة نموذج الانحراف المعياري المحسوب من قيم مجموعة.",
    "substr": "ترجع هذه الدالة السلسلة الفرعية ل str التي تبدأ عند نقاط البيع وتكون ذات طول len، أو شريحة صفيف البايت التي تبدأ عند نقاط البيع وتكون ذات طول len.",
    "tan": "ترجع هذه الدالة ظل الظل الخاص ب expr، كما لو كان محسوبا بواسطة java.lang.Math.tan.",
    "timestamp": "يلقي القيمة expr إلى الطابع الزمني لنوع البيانات الهدف.",
    "to_date": "يوزع التعبير date_str مع تعبير fmt إلى تاريخ. إرجاع فارغ مع إدخال غير صالح. بشكل افتراضي ، يتبع قواعد الصب إلى تاريخ إذا تم حذف fmt.",
    "to_timestamp": "يوزع التعبير timestamp_str مع تعبير fmt إلى طابع زمني. إرجاع فارغ مع إدخال غير صالح. بشكل افتراضي ، يتبع قواعد الصب إلى طابع زمني إذا تم حذف fmt.",
    "trim": "trim(str) - يزيل أحرف المسافة البادئة والزائدة من str. <br>        trim (BOTH trimStr FROM str) - إزالة الأحرف البادئة والزائدة trimStr من str <br>        trim (LEADING trimStr FROM str) - إزالة أحرف trimStr البادئة من str <br>        trim (TRAILING trimStr FROM str) - قم بإزالة أحرف trimStr الزائدة من str <br>        الحجج: <br>        str - تعبير سلسلة <br>        trimStr - أحرف سلسلة القطع المراد قصها ، القيمة الافتراضية هي مسافة واحدة <br>        كلاهما ، من - هذه كلمات رئيسية لتحديد قص أحرف السلسلة من طرفي السلسلة <br>        LEADING, FROM - هذه كلمات رئيسية لتحديد قص أحرف السلسلة من الطرف الأيسر من السلسلة <br>        زائدة ، من - هذه كلمات رئيسية لتحديد قص أحرف السلسلة من الطرف الأيمن من السلسلة",
    "ucase": "إرجاع str مع تغيير كافة الأحرف إلى أحرف كبيرة.",
    "upper": "إرجاع str مع تغيير كافة الأحرف إلى أحرف كبيرة.",
    "variance": "ترجع هذه الدالة تباين العينة المحسوب من قيم مجموعة.",
    "weekday": "إرجاع يوم الأسبوع للتاريخ/الطابع الزمني (0 = الاثنين، 1 = الثلاثاء، ...، 6 = الأحد).",
    "weekofyear": "ترجع هذه الدالة الأسبوع من السنة من التاريخ المحدد. يعتبر الأسبوع يبدأ يوم الاثنين والأسبوع 1 هو الأسبوع الأول مع >3 أيام.",
    "year": "إرجاع مكون السنة من طابع التاريخ/الوقت."
  }
}
